[
  {
    "cves": [
      "CVE-2023-44221",
      "CVE-2021-20035",
      "CVE-2024-38475"
    ],
    "cve_counts": {
      "CVE-2023-44221": 3,
      "CVE-2021-20035": 2,
      "CVE-2024-38475": 3
    },
    "title": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks",
    "permalink": "https://www.bleepingcomputer.com/news/security/sonicwall-sma100-vpn-vulnerabilities-now-exploited-in-attacks/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  ​Cybersecurity company SonicWall has warned customers that several vulnerabilities impacting its Secure Mobile Access (SMA) appliances are now being actively exploited in attacks. On Tuesday, SonicWall updated security advisories for the CVE-2023-44221 and CVE-2024-38475 security flaws to tag the two vulnerabilities as \"potentially being exploited in the wild.\" CVE-2023-44221 is described as a high-severity command injection vulnerability caused by improper neutralization of special elements in the SMA100 SSL-VPN management interface that enables attackers with admin privileges to inject arbitrary commands as a 'nobody' user. The second security bug, CVE-2024-38475, is rated as a critical severity flaw caused by improper escaping of output in mod_rewrite in Apache HTTP Server 2.4.59 and earlier. Successful exploitation can allow unauthenticated, remote attackers to gain code execution by mapping URLs to file system locations permitted to be served by the server. The two vulnerabilities impact SMA 200, SMA 210, SMA 400, SMA 410, and SMA 500v devices and are patched in firmware version 10.2.1.14-75sv and later. \"During further analysis, SonicWall and trusted security partners identified an additional exploitation technique using CVE-2024-38475, through which unauthorized access to certain files could enable session hijacking,\" SonicWall warned in an updated advisory. \"During further analysis, SonicWall and trusted security partners identified that 'CVE-2023-44221 - Post Authentication OS Command Injection' vulnerability is potentially being exploited in the wild,\" it added . \"SonicWall PSIRT recommends that customers review their SMA devices to ensure no unauthorized logins.\" Earlier this month, the company flagged another high-severity flaw patched almost four years ago and tracked as CVE-2021-20035 as actively exploited in remote code execution attacks targeting SMA100 VPN appliances. One day later, cybersecurity company Arctic Wolf said CVE-2021-20035 had been under active exploitation since at least January 2025 . CISA also added the security bug to its Known Exploited Vulnerabilities catalog , ordering U.S. federal agencies to secure their networks against ongoing attacks. In January, SonicWall urged admins to patch a critical flaw in SMA1000 secure access gateways that was being exploited in zero-day attacks, and one month later warned of an actively exploited authentication bypass flaw in Gen 6 and Gen 7 firewalls that lets hackers hijack VPN sessions . SonicWall SMA VPN devices targeted in attacks since January CISA tags SonicWall VPN flaw as actively exploited in attacks Protect your devices and data with this $40 five-year AdGuard VPN plan CISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything Overdue a password health-check? Audit your Active Directory for free Learn why identity attacks were the #1 threat facing organizations in 2024 Enhancing your DevSecOps with Wazuh, the open source XDR platform View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-3928"
    ],
    "cve_counts": {
      "CVE-2025-3928": 2
    },
    "title": "Commvault says recent breach didn't impact customer backup data",
    "permalink": "https://www.bleepingcomputer.com/news/security/commvault-says-recent-breach-didnt-impact-customer-backup-data/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Commvault, a leading provider of data protection solutions, says a nation-state threat actor who breached its Azure environment didn't gain access to customer backup data. Listed on NASDAQ since March 2006, Commvault is included in the S&P MidCap 400 Index and provides cyber resilience services to over 100,000 organizations. As the company first revealed on March 7 , 2025, Commvault discovered the incident after being notified by Microsoft on February 20 of suspicious activity within its Azure environment. A follow-up investigation into the breach found that the incident only affected a small number of Commvault customers and had not impacted the company's operations. \"Importantly, there has been no unauthorized access to customer backup data that Commvault stores and protects, and no material impact on our business operations or our ability to deliver products and services,\" Danielle Sheer, the company's Chief Trust Officer, said in a Wednesday update . \"We are working closely with two leading cybersecurity firms and are coordinating with the appropriate authorities, including the FBI, Cybersecurity and Infrastructure Security Agency (CISA), and others.\" In a support document containing indicators of compromise, Commvault advises customers to apply a Conditional Access policy to all Microsoft 365, Dynamics 365, and Azure AD single-tenant App registrations to protect their data against similar attack attempts. It also recommended to regularly monitor sign-in activity to detect access attempts originating from IP addresses outside of allowed ranges and to rotate and sync client secrets between Commvault and the Azure portal every 90 days. \"This can help quickly identify potential security breaches or account compromises. If any unauthorized access is detected, immediately report the incident to Commvault Support for further investigation and remediation,\" the company says. The company also noted in the original disclosure that the threat actors exploited a now-patched zero-day vulnerability ( CVE-2025-3928 ) in its Commvault Web Server software that remote authenticated attackers with low privileges can exploit remotely to plant webshells on target servers. CISA has also added the CVE-2025-3928 vulnerability to its Known Exploited Vulnerabilities Catalog on Monday, requiring federal agencies to secure their Commvault software by May 19, 2025, as mandated by the Binding Operational Directive (BOD) 22-01 issued in November 2021. \"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" CISA warned . Enhance your resume with this Microsoft Azure certification course deal EncryptHub's dual life: Cybercriminal vs Windows bug-bounty researcher MITRE says state hackers breached its network via Ivanti zero-days New Windows zero-day exploited by 11 state hacking groups since 2017 Microsoft March 2025 Patch Tuesday fixes 7 zero-days, 57 flaws Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Enhancing your DevSecOps with Wazuh, the open source XDR platform Overdue a password health-check? Audit your Active Directory for free Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Learn why identity attacks were the #1 threat facing organizations in 2024 Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-24252",
      "CVE-2025-24132",
      "CVE-2025-24206"
    ],
    "cve_counts": {
      "CVE-2025-24252": 1,
      "CVE-2025-24132": 1,
      "CVE-2025-24206": 1
    },
    "title": "Apple 'AirBorne' flaws can lead to zero-click AirPlay RCE attacks",
    "permalink": "https://www.bleepingcomputer.com/news/security/apple-airborne-flaws-can-lead-to-zero-click-airplay-rce-attacks/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  ​A set of security vulnerabilities in Apple's AirPlay Protocol and AirPlay Software Development Kit (SDK) exposed unpatched third-party and Apple devices to various attacks, including remote code execution. According to cybersecurity company Oligo Security security researchers who discovered and reported the flaws, they can be exploited in zero-click and one-click RCE attacks, man-in-the-middle (MITM) attacks, and denial of service (DoS) attacks, as well as to bypass access control list (ACL) and user interaction, to gain access to sensitive information, and read arbitrary local files. In all, Oligo disclosed 23 security vulnerabilities to Apple, which released security updates to address these vulnerabilities (collectively known as \"AirBorne\") on March 31 for iPhones and iPads ( iOS 18.4 and iPadOS 18.4 ), Macs ( macOS Ventura 13.7.5 , macOS Sonoma 14.7.5 , and macOS Sequoia 15.4 ), and Apple Vision Pro ( visionOS 2.4 ) devices. The company also patched the AirPlay audio SDK , the AirPlay video SDK , and the CarPlay Communication Plug-in . While the AirBorne vulnerabilities can only be exploited by attackers on the same network via wireless networks or peer-to-peer connections, they allow taking over vulnerable devices and using the access as a launchpad to compromise other AirPlay-enabled devices on the same network. Oligo's security researchers said they were able to demonstrate that attackers can use two of the security flaws (CVE-2025-24252 and CVE-2025-24132) to create wormable zero-click RCE exploits. Additionally, the CVE-2025-24206 user interaction bypass flaw enables a threat actor to bypass \"Accept\" click requirements on AirPlay requests and can be chained with other flaws to launch zero-click attacks. \"This means that an attacker can take over certain AirPlay-enabled devices and do things like deploy malware that spreads to devices on any local network the infected device connects to. This could lead to the delivery of other sophisticated attacks related to espionage, ransomware, supply-chain attacks, and more,\" Oligo warned . \"Because AirPlay is a fundamental piece of software for Apple devices (Mac, iPhone, iPad, AppleTV, etc.) as well as third-party devices that leverage the AirPlay SDK, this class of vulnerabilities could have far-reaching impacts.\" The cybersecurity company advises organizations to immediately update any corporate Apple devices and AirPlay-enabled devices to the latest software release and ask employees to also update all their personal AirPlay devices. Additional measures users can take to reduce the attack surface include updating all their Apple devices to the latest version, disabling the AirPlay receiver if not used, restricting AirPlay access to trusted devices using firewall rules, and reducing the attack surface by only allowing AirPlay for the current user. Apple says that there are over 2.35 billion active Apple devices around the world (including iPhones, iPads, Macs, and others), and Oligo estimates that there are also tens of millions of third-party audio devices like speakers and TVs with AirPlay support, not including car infotainment systems with CarPlay support. Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw SAP fixes suspected NetWeaver zero-day exploited in attacks Apple backports zero-day patches to older iPhones and Macs Apple fixes WebKit zero-day exploited in ‘extremely sophisticated’ attacks Active! Mail RCE flaw exploited in attacks on Japanese orgs Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Enhancing your DevSecOps with Wazuh, the open source XDR platform Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-3928",
      "CVE-2025-1976",
      "CVE-2025-42599"
    ],
    "cve_counts": {
      "CVE-2025-3928": 3,
      "CVE-2025-1976": 2,
      "CVE-2025-42599": 1
    },
    "title": "CISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks",
    "permalink": "https://www.bleepingcomputer.com/news/security/cisa-tags-broadcom-fabric-os-commvault-flaws-as-exploited-in-attacks/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  The U.S. Cybersecurity & Infrastructure Security Agency (CISA) is warning of Broadcom Brocade Fabric OS, Commvault web servers, and Qualitia Active! Mail clients vulnerabilities that are actively exploited in attacks. The flaws were added yesterday to CISA's 'Known Exploited Vulnerabilities' (KEV) catalog , with the Broadcom Brocade Fabric OS and Commvault flaws not previously tagged as exploited. Broadcom Brocade Fabric OS is a specialized operating system that runs on the company's Brocade Fibre Channel switches to manage and optimize storage area networks (SAN). Earlier this month, Broadcom disclosed an arbitrary code execution flaw impacting Fabric OS versions 9.1.0 through 9.1.1d6, tracked under CVE-2025-1976. While the flaw requires admin privileges to exploit, Broadcom says it has been actively exploited in attacks. \"This vulnerability can allow the user to execute any existing Fabric OS command or can also be used to modify the Fabric OS itself, including adding their own subroutines,\" reads Broadcom's bulletin . \"Even though achieving this exploit first requires valid access to a role with admin privileges, this vulnerability has been actively exploited in the field.\" CVE-2025-1976 was addressed with the release of Brocade Fabric OS 9.1.1d7. The latest branch, 9.2.0, is not impacted by this vulnerability. The Commvault flaw, tracked under CVE-2025-3928 , is an unspecified security problem that authenticated attackers can exploit remotely to plant webshells on target servers. Commvault web servers are user-facing and API components of a backup system used by enterprises to protect and restore critical data. Despite the requirements for authentication and exposure of the environment to the internet, the flaw is under active exploitation in the wild. CVE-2025-3928 was fixed in versions 11.36.46, 11.32.89, 11.28.141, and 11.20.217 for Windows and Linux platforms. The third flaw CISA added to KEV is CVE-2025-42599, a stack-based buffer overflow problem impacting all versions of Active! up to and including 'BuildInfo: 6.60.05008561' on all OS platforms. Active! mail is a web-based email client widely used by government, financial, and IT service organizations in Japan. The flaw was flagged as actively exploited last week by Japan's CERT, while SMB providers and ISPs in the country also announced service outages caused by related exploitation activity. Qualitia addressed the problem with the release of Active! Mail 6 BuildInfo: 6.60.06008562. CISA has given impacted organizations until May 17, 2025, to apply fixes or available mitigations for CVE-2025-3928 and May 19, 2025, for the other two flaws. CISA flags Craft CMS code injection flaw as exploited in attacks CentreStack RCE exploited as zero-day to breach file sharing servers CISA tags NAKIVO backup flaw as actively exploited in attacks SAP fixes suspected NetWeaver zero-day exploited in attacks Lazarus hackers breach six companies in watering hole attacks Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 Enhancing your DevSecOps with Wazuh, the open source XDR platform View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Overdue a password health-check? Audit your Active Directory for free Rethinking Automated Penetration Testing: Why Validation Changes Everything Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-31324"
    ],
    "cve_counts": {
      "CVE-2025-31324": 3
    },
    "title": "Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw",
    "permalink": "https://www.bleepingcomputer.com/news/security/over-1-200-sap-netweaver-servers-vulnerable-to-actively-exploited-flaw/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Over 1,200 internet-exposed SAP NetWeaver instances are vulnerable to an actively exploited maximum severity unauthenticated file upload vulnerability that allows attackers to hijack servers. SAP NetWeaver is an application server and development platform that runs and connects SAP and non-SAP applications across different technologies. Last week, SAP disclosed an unauthenticated file upload vulnerability, tracked as CVE-2025-31324, in SAP NetWeaver Visual Composer, specifically the Metadata Uploader component. The flaw allows remote attackers to upload arbitrary executable files on exposed instances without authenticating, achieving code execution and full system compromise. Multiple cybersecurity firms, including ReliaQuest, watchTowr, and Onapsis, confirmed the flaw is actively exploited in attacks , with threat actors utilizing it to drop web shells on vulnerable servers. A SAP spokesperson told BleepingComputer that they were aware of these attempts and released a workaround on April 8, 2024, followed by a security update that addressed CVE-2025-31324 on April 25. SAP told BleepingComputer that they are not aware of any cases where these attacks impacted customer data or systems. Researchers have now confirmed that many vulnerable SAP Netweaver servers are exposed on the internet, making them prime targets for attacks. The Shadowserver Foundation found the 427 exposed servers , warning of the massive exposed attack surface and the potentially severe repercussions of exploitation. Most of the vulnerable systems (149) are in the United States, followed by India (50), Australia (37), China (31), Germany (30), the Netherlands (13), Brazil (10), and France (10). However, cyber defense search engine Onyphe paints a more dire picture, telling BleepingComputer that there are 1,284 vulnerable servers exposed online, with 474 already having been compromised with webshells. \"Something like 20 Fortune 500/Global 500 companies are vulnerable, and many of them are compromised,\" Onyphe CTO Patrice Auffret told BleepingComputer. Researchers reported that the threat actors are utilizing webshells with names like, \"cache.jsp\" and \"helper.jsp.\" Howver, Nextron Research says they are also using random names, making it more difficult to find vulnerable Netweaver instances. While the number of servers is not massive, the risk is still significant, given that large enterprises and multinational corporations commonly use SAP NetWeaver. To address the risk, it is recommended that the latest security update be applied by following the vendor's instructions in this bulletin . If unable to apply the update, the below mitigations are recommended: RedRays has also released a scanner tool for CVE-2025-31324 that can help pinpoint risks in large environments. BleepingComputer contacted SAP with further questions about the active exploitation and will update the story with any response. SAP fixes suspected NetWeaver zero-day exploited in attacks Apple 'AirBorne' flaws can lead to zero-click AirPlay RCE attacks Active! Mail RCE flaw exploited in attacks on Japanese orgs SonicWall SMA VPN devices targeted in attacks since January CISA tags SonicWall VPN flaw as actively exploited in attacks Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 Enhancing your DevSecOps with Wazuh, the open source XDR platform Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Overdue a password health-check? Audit your Active Directory for free Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  }
]