[
  {
    "cves": [
      "CVE-2023-44221",
      "CVE-2021-20035",
      "CVE-2024-38475"
    ],
    "cve_counts": {
      "CVE-2023-44221": 3,
      "CVE-2021-20035": 2,
      "CVE-2024-38475": 3
    },
    "title": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks",
    "permalink": "https://www.bleepingcomputer.com/news/security/sonicwall-sma100-vpn-vulnerabilities-now-exploited-in-attacks/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  ​Cybersecurity company SonicWall has warned customers that several vulnerabilities impacting its Secure Mobile Access (SMA) appliances are now being actively exploited in attacks. On Tuesday, SonicWall updated security advisories for the CVE-2023-44221 and CVE-2024-38475 security flaws to tag the two vulnerabilities as \"potentially being exploited in the wild.\" CVE-2023-44221 is described as a high-severity command injection vulnerability caused by improper neutralization of special elements in the SMA100 SSL-VPN management interface that enables attackers with admin privileges to inject arbitrary commands as a 'nobody' user. The second security bug, CVE-2024-38475, is rated as a critical severity flaw caused by improper escaping of output in mod_rewrite in Apache HTTP Server 2.4.59 and earlier. Successful exploitation can allow unauthenticated, remote attackers to gain code execution by mapping URLs to file system locations permitted to be served by the server. The two vulnerabilities impact SMA 200, SMA 210, SMA 400, SMA 410, and SMA 500v devices and are patched in firmware version 10.2.1.14-75sv and later. \"During further analysis, SonicWall and trusted security partners identified an additional exploitation technique using CVE-2024-38475, through which unauthorized access to certain files could enable session hijacking,\" SonicWall warned in an updated advisory. \"During further analysis, SonicWall and trusted security partners identified that 'CVE-2023-44221 - Post Authentication OS Command Injection' vulnerability is potentially being exploited in the wild,\" it added . \"SonicWall PSIRT recommends that customers review their SMA devices to ensure no unauthorized logins.\" Earlier this month, the company flagged another high-severity flaw patched almost four years ago and tracked as CVE-2021-20035 as actively exploited in remote code execution attacks targeting SMA100 VPN appliances. One day later, cybersecurity company Arctic Wolf said CVE-2021-20035 had been under active exploitation since at least January 2025 . CISA also added the security bug to its Known Exploited Vulnerabilities catalog , ordering U.S. federal agencies to secure their networks against ongoing attacks. In January, SonicWall urged admins to patch a critical flaw in SMA1000 secure access gateways that was being exploited in zero-day attacks, and one month later warned of an actively exploited authentication bypass flaw in Gen 6 and Gen 7 firewalls that lets hackers hijack VPN sessions . SonicWall SMA VPN devices targeted in attacks since January CISA tags SonicWall VPN flaw as actively exploited in attacks Protect your devices and data with this $40 five-year AdGuard VPN plan CISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything Overdue a password health-check? Audit your Active Directory for free Learn why identity attacks were the #1 threat facing organizations in 2024 Enhancing your DevSecOps with Wazuh, the open source XDR platform View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-3928"
    ],
    "cve_counts": {
      "CVE-2025-3928": 2
    },
    "title": "Commvault says recent breach didn't impact customer backup data",
    "permalink": "https://www.bleepingcomputer.com/news/security/commvault-says-recent-breach-didnt-impact-customer-backup-data/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Commvault, a leading provider of data protection solutions, says a nation-state threat actor who breached its Azure environment didn't gain access to customer backup data. Listed on NASDAQ since March 2006, Commvault is included in the S&P MidCap 400 Index and provides cyber resilience services to over 100,000 organizations. As the company first revealed on March 7 , 2025, Commvault discovered the incident after being notified by Microsoft on February 20 of suspicious activity within its Azure environment. A follow-up investigation into the breach found that the incident only affected a small number of Commvault customers and had not impacted the company's operations. \"Importantly, there has been no unauthorized access to customer backup data that Commvault stores and protects, and no material impact on our business operations or our ability to deliver products and services,\" Danielle Sheer, the company's Chief Trust Officer, said in a Wednesday update . \"We are working closely with two leading cybersecurity firms and are coordinating with the appropriate authorities, including the FBI, Cybersecurity and Infrastructure Security Agency (CISA), and others.\" In a support document containing indicators of compromise, Commvault advises customers to apply a Conditional Access policy to all Microsoft 365, Dynamics 365, and Azure AD single-tenant App registrations to protect their data against similar attack attempts. It also recommended to regularly monitor sign-in activity to detect access attempts originating from IP addresses outside of allowed ranges and to rotate and sync client secrets between Commvault and the Azure portal every 90 days. \"This can help quickly identify potential security breaches or account compromises. If any unauthorized access is detected, immediately report the incident to Commvault Support for further investigation and remediation,\" the company says. The company also noted in the original disclosure that the threat actors exploited a now-patched zero-day vulnerability ( CVE-2025-3928 ) in its Commvault Web Server software that remote authenticated attackers with low privileges can exploit remotely to plant webshells on target servers. CISA has also added the CVE-2025-3928 vulnerability to its Known Exploited Vulnerabilities Catalog on Monday, requiring federal agencies to secure their Commvault software by May 19, 2025, as mandated by the Binding Operational Directive (BOD) 22-01 issued in November 2021. \"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" CISA warned . Enhance your resume with this Microsoft Azure certification course deal EncryptHub's dual life: Cybercriminal vs Windows bug-bounty researcher MITRE says state hackers breached its network via Ivanti zero-days New Windows zero-day exploited by 11 state hacking groups since 2017 Microsoft March 2025 Patch Tuesday fixes 7 zero-days, 57 flaws Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Enhancing your DevSecOps with Wazuh, the open source XDR platform Overdue a password health-check? Audit your Active Directory for free Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Learn why identity attacks were the #1 threat facing organizations in 2024 Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-24252",
      "CVE-2025-24132",
      "CVE-2025-24206"
    ],
    "cve_counts": {
      "CVE-2025-24252": 1,
      "CVE-2025-24132": 1,
      "CVE-2025-24206": 1
    },
    "title": "Apple 'AirBorne' flaws can lead to zero-click AirPlay RCE attacks",
    "permalink": "https://www.bleepingcomputer.com/news/security/apple-airborne-flaws-can-lead-to-zero-click-airplay-rce-attacks/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  ​A set of security vulnerabilities in Apple's AirPlay Protocol and AirPlay Software Development Kit (SDK) exposed unpatched third-party and Apple devices to various attacks, including remote code execution. According to cybersecurity company Oligo Security security researchers who discovered and reported the flaws, they can be exploited in zero-click and one-click RCE attacks, man-in-the-middle (MITM) attacks, and denial of service (DoS) attacks, as well as to bypass access control list (ACL) and user interaction, to gain access to sensitive information, and read arbitrary local files. In all, Oligo disclosed 23 security vulnerabilities to Apple, which released security updates to address these vulnerabilities (collectively known as \"AirBorne\") on March 31 for iPhones and iPads ( iOS 18.4 and iPadOS 18.4 ), Macs ( macOS Ventura 13.7.5 , macOS Sonoma 14.7.5 , and macOS Sequoia 15.4 ), and Apple Vision Pro ( visionOS 2.4 ) devices. The company also patched the AirPlay audio SDK , the AirPlay video SDK , and the CarPlay Communication Plug-in . While the AirBorne vulnerabilities can only be exploited by attackers on the same network via wireless networks or peer-to-peer connections, they allow taking over vulnerable devices and using the access as a launchpad to compromise other AirPlay-enabled devices on the same network. Oligo's security researchers said they were able to demonstrate that attackers can use two of the security flaws (CVE-2025-24252 and CVE-2025-24132) to create wormable zero-click RCE exploits. Additionally, the CVE-2025-24206 user interaction bypass flaw enables a threat actor to bypass \"Accept\" click requirements on AirPlay requests and can be chained with other flaws to launch zero-click attacks. \"This means that an attacker can take over certain AirPlay-enabled devices and do things like deploy malware that spreads to devices on any local network the infected device connects to. This could lead to the delivery of other sophisticated attacks related to espionage, ransomware, supply-chain attacks, and more,\" Oligo warned . \"Because AirPlay is a fundamental piece of software for Apple devices (Mac, iPhone, iPad, AppleTV, etc.) as well as third-party devices that leverage the AirPlay SDK, this class of vulnerabilities could have far-reaching impacts.\" The cybersecurity company advises organizations to immediately update any corporate Apple devices and AirPlay-enabled devices to the latest software release and ask employees to also update all their personal AirPlay devices. Additional measures users can take to reduce the attack surface include updating all their Apple devices to the latest version, disabling the AirPlay receiver if not used, restricting AirPlay access to trusted devices using firewall rules, and reducing the attack surface by only allowing AirPlay for the current user. Apple says that there are over 2.35 billion active Apple devices around the world (including iPhones, iPads, Macs, and others), and Oligo estimates that there are also tens of millions of third-party audio devices like speakers and TVs with AirPlay support, not including car infotainment systems with CarPlay support. Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw SAP fixes suspected NetWeaver zero-day exploited in attacks Apple backports zero-day patches to older iPhones and Macs Apple fixes WebKit zero-day exploited in ‘extremely sophisticated’ attacks Active! Mail RCE flaw exploited in attacks on Japanese orgs Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Enhancing your DevSecOps with Wazuh, the open source XDR platform Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-3928",
      "CVE-2025-1976",
      "CVE-2025-42599"
    ],
    "cve_counts": {
      "CVE-2025-3928": 3,
      "CVE-2025-1976": 2,
      "CVE-2025-42599": 1
    },
    "title": "CISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks",
    "permalink": "https://www.bleepingcomputer.com/news/security/cisa-tags-broadcom-fabric-os-commvault-flaws-as-exploited-in-attacks/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  The U.S. Cybersecurity & Infrastructure Security Agency (CISA) is warning of Broadcom Brocade Fabric OS, Commvault web servers, and Qualitia Active! Mail clients vulnerabilities that are actively exploited in attacks. The flaws were added yesterday to CISA's 'Known Exploited Vulnerabilities' (KEV) catalog , with the Broadcom Brocade Fabric OS and Commvault flaws not previously tagged as exploited. Broadcom Brocade Fabric OS is a specialized operating system that runs on the company's Brocade Fibre Channel switches to manage and optimize storage area networks (SAN). Earlier this month, Broadcom disclosed an arbitrary code execution flaw impacting Fabric OS versions 9.1.0 through 9.1.1d6, tracked under CVE-2025-1976. While the flaw requires admin privileges to exploit, Broadcom says it has been actively exploited in attacks. \"This vulnerability can allow the user to execute any existing Fabric OS command or can also be used to modify the Fabric OS itself, including adding their own subroutines,\" reads Broadcom's bulletin . \"Even though achieving this exploit first requires valid access to a role with admin privileges, this vulnerability has been actively exploited in the field.\" CVE-2025-1976 was addressed with the release of Brocade Fabric OS 9.1.1d7. The latest branch, 9.2.0, is not impacted by this vulnerability. The Commvault flaw, tracked under CVE-2025-3928 , is an unspecified security problem that authenticated attackers can exploit remotely to plant webshells on target servers. Commvault web servers are user-facing and API components of a backup system used by enterprises to protect and restore critical data. Despite the requirements for authentication and exposure of the environment to the internet, the flaw is under active exploitation in the wild. CVE-2025-3928 was fixed in versions 11.36.46, 11.32.89, 11.28.141, and 11.20.217 for Windows and Linux platforms. The third flaw CISA added to KEV is CVE-2025-42599, a stack-based buffer overflow problem impacting all versions of Active! up to and including 'BuildInfo: 6.60.05008561' on all OS platforms. Active! mail is a web-based email client widely used by government, financial, and IT service organizations in Japan. The flaw was flagged as actively exploited last week by Japan's CERT, while SMB providers and ISPs in the country also announced service outages caused by related exploitation activity. Qualitia addressed the problem with the release of Active! Mail 6 BuildInfo: 6.60.06008562. CISA has given impacted organizations until May 17, 2025, to apply fixes or available mitigations for CVE-2025-3928 and May 19, 2025, for the other two flaws. CISA flags Craft CMS code injection flaw as exploited in attacks CentreStack RCE exploited as zero-day to breach file sharing servers CISA tags NAKIVO backup flaw as actively exploited in attacks SAP fixes suspected NetWeaver zero-day exploited in attacks Lazarus hackers breach six companies in watering hole attacks Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 Enhancing your DevSecOps with Wazuh, the open source XDR platform View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Overdue a password health-check? Audit your Active Directory for free Rethinking Automated Penetration Testing: Why Validation Changes Everything Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-31324"
    ],
    "cve_counts": {
      "CVE-2025-31324": 3
    },
    "title": "Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw",
    "permalink": "https://www.bleepingcomputer.com/news/security/over-1-200-sap-netweaver-servers-vulnerable-to-actively-exploited-flaw/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Over 1,200 internet-exposed SAP NetWeaver instances are vulnerable to an actively exploited maximum severity unauthenticated file upload vulnerability that allows attackers to hijack servers. SAP NetWeaver is an application server and development platform that runs and connects SAP and non-SAP applications across different technologies. Last week, SAP disclosed an unauthenticated file upload vulnerability, tracked as CVE-2025-31324, in SAP NetWeaver Visual Composer, specifically the Metadata Uploader component. The flaw allows remote attackers to upload arbitrary executable files on exposed instances without authenticating, achieving code execution and full system compromise. Multiple cybersecurity firms, including ReliaQuest, watchTowr, and Onapsis, confirmed the flaw is actively exploited in attacks , with threat actors utilizing it to drop web shells on vulnerable servers. A SAP spokesperson told BleepingComputer that they were aware of these attempts and released a workaround on April 8, 2024, followed by a security update that addressed CVE-2025-31324 on April 25. SAP told BleepingComputer that they are not aware of any cases where these attacks impacted customer data or systems. Researchers have now confirmed that many vulnerable SAP Netweaver servers are exposed on the internet, making them prime targets for attacks. The Shadowserver Foundation found the 427 exposed servers , warning of the massive exposed attack surface and the potentially severe repercussions of exploitation. Most of the vulnerable systems (149) are in the United States, followed by India (50), Australia (37), China (31), Germany (30), the Netherlands (13), Brazil (10), and France (10). However, cyber defense search engine Onyphe paints a more dire picture, telling BleepingComputer that there are 1,284 vulnerable servers exposed online, with 474 already having been compromised with webshells. \"Something like 20 Fortune 500/Global 500 companies are vulnerable, and many of them are compromised,\" Onyphe CTO Patrice Auffret told BleepingComputer. Researchers reported that the threat actors are utilizing webshells with names like, \"cache.jsp\" and \"helper.jsp.\" Howver, Nextron Research says they are also using random names, making it more difficult to find vulnerable Netweaver instances. While the number of servers is not massive, the risk is still significant, given that large enterprises and multinational corporations commonly use SAP NetWeaver. To address the risk, it is recommended that the latest security update be applied by following the vendor's instructions in this bulletin . If unable to apply the update, the below mitigations are recommended: RedRays has also released a scanner tool for CVE-2025-31324 that can help pinpoint risks in large environments. BleepingComputer contacted SAP with further questions about the active exploitation and will update the story with any response. SAP fixes suspected NetWeaver zero-day exploited in attacks Apple 'AirBorne' flaws can lead to zero-click AirPlay RCE attacks Active! Mail RCE flaw exploited in attacks on Japanese orgs SonicWall SMA VPN devices targeted in attacks since January CISA tags SonicWall VPN flaw as actively exploited in attacks Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 Enhancing your DevSecOps with Wazuh, the open source XDR platform Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Overdue a password health-check? Audit your Active Directory for free Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2024-58136",
      "CVE-2025-32432",
      "CVE-2025-23209"
    ],
    "cve_counts": {
      "CVE-2024-58136": 2,
      "CVE-2025-32432": 3,
      "CVE-2025-23209": 1
    },
    "title": "Craft CMS RCE exploit chain used in zero-day attacks to steal data",
    "permalink": "https://www.bleepingcomputer.com/news/security/craft-cms-rce-exploit-chain-used-in-zero-day-attacks-to-steal-data/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Two vulnerabilities impacting Craft CMS were chained together in zero-day attacks to breach servers and steal data, with exploitation ongoing, according to CERT Orange Cyberdefense. The vulnerabilities were discovered by Orange Cyberdefense's CSIRT, which was called in to investigate a compromised server. As part of the investigation, they discovered that two zero-day vulnerabilities impacting Craft CMS were exploited to breach the server: According to a report by SensePost, the ethical hacking team of Orange Cyberdefense, the threat actors chained both of these vulnerabilities together to breach servers and upload a PHP file manager. The attack begins with the exploitation of CVE-2025-32432, which allows attackers to send a specially crafted request containing a \"return URL\" as a parameter that is saved in a PHP session file. This session name is sent to the visitor as part of the response to the HTTP request. The second stage of the attack leveraged a flaw in the Yii framework (CVE-2024-58136), which Craft CMS utilizes. To exploit this flaw, the attacker sent a malicious JSON payload that caused the PHP code in the session file to be executed on the server. This allowed the attacker to install a PHP-based file manager on the server to compromise the system further. Orange told BleepingComputer that they saw additional compromise steps, including additional uploads of backdoors and data exfiltration. More information about this post-exploitation activity will be detailed in an upcoming blog post. The Yii developers ultimately fixed the CVE-2024-58136 flaw in version Yii 2.0.52 released on April 9th. Craft CMS also fixed the CVE-2025-32432 flaw in versions 3.9.15, 4.14.15, and 5.6.17 on April 10th. While they did not update Yii to the latest version in Craft CMS, Orange says that the attack chain is still fixed. \"Today, the 2.0.51 (vulnerable) is still by default in Craft. However, with the CVE-2025-32432 fix, the Yii issue cannot be triggerable now,\" Orange told BleepingComputer. Craft CMS recommends that admins perform the following steps if they believe their site has been compromised: For full indicators of compromise, including IP addresses and file names, you can view the appendix in SensePost's report. In February, CISA also tagged a code injection (RCE) flaw tracked as CVE-2025-23209 in Craft CMS 4 and 5 as being exploited in attacks. SAP fixes suspected NetWeaver zero-day exploited in attacks CISA flags Craft CMS code injection flaw as exploited in attacks Lazarus hackers breach six companies in watering hole attacks Apple fixes two zero-days exploited in targeted iPhone attacks Ivanti Connect Secure zero-days exploited to deploy custom malware Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Overdue a password health-check? Audit your Active Directory for free Rethinking Automated Penetration Testing: Why Validation Changes Everything Enhancing your DevSecOps with Wazuh, the open source XDR platform Learn why identity attacks were the #1 threat facing organizations in 2024 Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-21204"
    ],
    "cve_counts": {
      "CVE-2025-21204": 1
    },
    "title": "Windows \"inetpub\" security fix can be abused to block future updates",
    "permalink": "https://www.bleepingcomputer.com/news/microsoft/windows-inetpub-security-fix-can-be-abused-to-block-future-updates/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  A recent Windows security update that creates an ‘inetpub’ folder has introduced a new weakness allowing attackers to prevent the installation of future updates. After people installed this month's Microsoft Patch Tuesday security updates, Windows users suddenly found an \"inetpub\" folder owned by the SYSTEM account created in the root of the system drive, normally the C: drive. It was strange to see this folder created as it is normally used to hold files associated with Microsoft's Internet Information Service web server, which was not installed on these devices. In an update to a security advisory , Microsoft later confirmed that the C:\\inetpub folder was part of a fix for a Windows Process Activation elevation of privilege vulnerability tracked as CVE-2025-21204, with the company warning not to delete the folder . \"After installing the updates listed in the Security Updates table for your operating system, a new %systemdrive%\\inetpub folder will be created on your device,\" confirmed Microsoft . \"This folder should not be deleted regardless of whether Internet Information Services (IIS) is active on the target device. This behavior is part of changes that increase protection and does not require any action from IT admins and end users.\" However, cybersecurity expert Kevin Beaumont has demonstrated that this folder can be abused to prevent further Windows updates from being installed if it is created a certain way. \"I've discovered this fix introduces a denial of service vulnerability in the Windows servicing stack that allows non-admin users to stop all future Windows security updates,\" Kevin Beaumont. In a new report, Beaumont says that Windows users, even those without administrative privileges, can create a junction between C:\\inetpub and a Windows file, like C:\\windows\\system32\\notepad.exe using the following command. A Windows junction is a special type of folder that redirects access to another folder on the same or another drive, making it appear as though the content exists in both locations. When asked why this junction is preventing the update from being installed, Beaumont says he believes it's because the update expects a folder rather than a file. \"It works with basically any file, I think it's because the servicing stack expects c:\\inetpub to be a directory - but mklink allows you to make a junction to a file,\" Beaumont told BleepingComputer. According to Microsoft's documentation , junctions are meant to be links between folders rather than between files. However, as you can see from the image earlier in the article, it is still possible to create one as shown in the image below. With this junction created, if you attempt to install the April security update, it will not install correctly, giving a 0x800F081F error code . This code is related to the error \"CBS_E_SOURCE_MISSING,\" which means a package or file was not found. Beaumont says he reported the bug to Microsoft, who has assigned it a \"Medium\" severity classification and closed his case, stating they will consider fixing it in the future. \"After careful investigation, this case is currently rated as a Moderate severity issue,\" Microsoft emailed Beaumont . \"It does not meet MSRCs current bar for immediate servicing as the update fails to apply only if the 'inetpub' folder is a junction to a file and succeeds upon deleting the inetpub symlink and retrying.\" BleepingComputer also contacted Microsoft about this bug on Wednesday but has not received a response yet. Microsoft: Windows 'inetpub' folder created by security fix, don’t delete Microsoft April 2025 Patch Tuesday fixes exploited zero-day, 134 flaws Microsoft adds hotpatching support to Windows 11 Enterprise Microsoft March 2025 Patch Tuesday fixes 7 zero-days, 57 flaws Microsoft: Windows Server hotpatching to require subscription It seems Microsoft can't get it right. They \"fix\" a security issue only to cause another. They are better off removing inetpub and figure out how to fix the original security issue without it. But knowing them, an update to remove inetpub will also delete the contents of a web site. :-) They have been doing these guacamole fixes for a while now (take print spooler as an example). It is out of control and they are swapping security fixes with broken functionality and vice versa. They are literally at their 'Kessler' syndrome phase. If ever there was a reason to abandon ship and head to a Linux distro ... Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Enhancing your DevSecOps with Wazuh, the open source XDR platform Rethinking Automated Penetration Testing: Why Validation Changes Everything Learn why identity attacks were the #1 threat facing organizations in 2024 View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Overdue a password health-check? Audit your Active Directory for free Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-31324",
      "CVE-2025-31330",
      "CVE-2025-27429"
    ],
    "cve_counts": {
      "CVE-2025-31324": 6,
      "CVE-2025-31330": 1,
      "CVE-2025-27429": 1
    },
    "title": "SAP fixes suspected NetWeaver zero-day exploited in attacks",
    "permalink": "https://www.bleepingcomputer.com/news/security/sap-fixes-suspected-netweaver-zero-day-exploited-in-attacks/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  SAP has released out-of-band emergency NetWeaver updates to fix a suspected remote code execution (RCE) zero-day flaw actively exploited to hijack servers. The vulnerability, tracked under CVE-2025-31324 and rated critical (CVSS v3 score: 10.0), is an unauthenticated file upload vulnerability in SAP NetWeaver Visual Composer, specifically the Metadata Uploader component. It allows attackers to upload malicious executable files without logging in, potentially leading to remote code execution and full system compromise. Though the vendor's bulletin isn't public, ReliaQuest reported earlier this week about an actively exploited vulnerability on SAP NetWeaver Visual Composer, specifically the '/developmentserver/metadatauploader' endpoint, which aligns with CVE-2025-31324. ReliaQuest reported that multiple customers were compromised via unauthorized file uploads on SAP NetWeaver, with the attackers uploading JSP webshells to publicly accessible directories. These uploads enabled remote code execution via simple GET requests to the JSP files, allowing command execution from the browser, file management actions (upload/download), and more. In the post-exploitation phase, the attackers deployed the 'Brute Ratel' red team tool, the 'Heaven's Gate' security bypassing technique, and injected MSBuild-compiled code into dllhost.exe for stealth. ReliaQuest noted in the report that exploitation did not require authentication and that the compromised systems were fully patched, indicating that they were targeted by a zero-day exploit. Security firm watchTowr also confirmed to BleepingComputer they are seeing active exploitation linked to CVE-2025-31324. \"Unauthenticated attackers can abuse built-in functionality to upload arbitrary files to an SAP NetWeaver instance, which means full Remote Code Execution and total system compromise,\" stated watchTowr CEO Benjamin Harris. \"watchTowr is seeing active exploitation by threat actors, who are using this vulnerability to drop web shell backdoors onto exposed systems and gain further access.\" \"This active in-the-wild exploitation and widespread impact makes it incredibly likely that we'll soon see prolific exploitation by multiple parties.\" The vulnerability impacts the Visual Composer Framework 7.50, and the recommended action is to apply the latest patch. This emergency security update was made available after SAP's regular 'April 2025' update , so if you applied that update earlier this month (released on April 8, 2025), you're still vulnerable to CVE-2025-31324. Moreover, the emergency update includes fixes for two more critical vulnerabilities, namely CVE-2025-27429 (code injection in SAP S/4HANA) and CVE-2025-31330 (code injection in SAP Landscape Transformation). Those unable to apply the updates that address CVE-2025-31324 are recommended to perform the following mitigations: ReliaQuest recommends performing a deep environment scan to locate and delete suspect files before applying the mitigations. Update 4/25 - A SAP spokesperson disputed via a statement to BleepingComputer that CVE-2025-31324 was successfully exploited in actual attacks. \"SAP was made aware of a vulnerability in SAP NETWEAVER Visual Composer, which may have allowed unauthenticated and unauthorized code execution in certain Java Servlet,\" stated the SAP spokesperson. \"SAP is not aware that SAP customer data or systems were impacted by these vulnerabilities. A workaround was released on April 8, 2025, and a patch is currently available. Customers are recommended to apply the patch immediately.\" Meanwhile, cybersecurity firm Onapsis published a report saying it also observed active exploitation . Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw Active! Mail RCE flaw exploited in attacks on Japanese orgs Ivanti patches Connect Secure zero-day exploited since mid-March Critical RCE flaw in Apache Tomcat actively exploited in attacks Critical PHP RCE vulnerability mass exploited in new attacks Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free Enhancing your DevSecOps with Wazuh, the open source XDR platform Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2024-54085"
    ],
    "cve_counts": {
      "CVE-2024-54085": 3
    },
    "title": "ASUS releases fix for AMI bug that lets hackers brick servers",
    "permalink": "https://www.bleepingcomputer.com/news/security/asus-releases-fix-for-ami-bug-that-lets-hackers-brick-servers/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  ASUS has released security updates to address CVE-2024-54085, a maximum severity flaw that could allow attackers to hijack and potentially brick servers. The flaw impacts American Megatrends International's MegaRAC Baseboard Management Controller (BMC) software, used by over a dozen server hardware vendors, including HPE, ASUS, and ASRock. The CVE-2024-54085 flaw is remotely exploitable, potentially leading to malware infections, firmware modifications, and irreversible physical damage through over-volting. \"A local or remote attacker can exploit the vulnerability by accessing the remote management interfaces (Redfish) or the internal host to the BMC interface (Redfish),\" explained Eclypsium in a related report . \"Exploitation of this vulnerability allows an attacker to remotely control the compromised server, remotely deploy malware, ransomware, firmware tampering, bricking motherboard components (BMC or potentially BIOS/UEFI), potential server physical damage (over-voltage / bricking), and indefinite reboot loops that a victim cannot stop.\" Though AMI released a bulletin along with patches on March 11, 2025, time was needed for impacted OEMs to implement the fixes on their products. Today, ASUS announced they have released fixes for CVE-2024-54085 for four motherboard models impacted by the bug. The updates and recommended BMC firmware version users should upgrade to are: Given the severity of the vulnerability and the ability to perform remote exploitation, it is crucial to perform the firmware update as soon as possible. After downloading the latest BMC firmware update (.ima file), you can apply it through the web interface > Maintenance > Firmware Update, select the file, and click 'Start Firmware Update.' It is also recommended that you check the 'Full Flash' option. For detailed instructions on how to perform MBC firmware updates safely and troubleshooting, check ASUS FAQ here . ASUS warns of critical auth bypass flaw in routers using AiCloud CISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks SAP fixes suspected NetWeaver zero-day exploited in attacks Craft CMS RCE exploit chain used in zero-day attacks to steal data CISA flags Craft CMS code injection flaw as exploited in attacks Holy cow. The type of vul to give insomnia to any sysadmin Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything Overdue a password health-check? Audit your Active Directory for free View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Learn why identity attacks were the #1 threat facing organizations in 2024 Enhancing your DevSecOps with Wazuh, the open source XDR platform Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-42599"
    ],
    "cve_counts": {
      "CVE-2025-42599": 2
    },
    "title": "Active! Mail RCE flaw exploited in attacks on Japanese orgs",
    "permalink": "https://www.bleepingcomputer.com/news/security/active-mail-rce-flaw-exploited-in-attacks-on-japanese-orgs/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  An Active! Mail zero-day remote code execution vulnerability is actively exploited in attacks on large organizations in Japan. Active! mail is a web-based email client developed initially by TransWARE and later acquired by Qualitia, both Japanese companies. While it's not widely used worldwide like Gmail or Outlook, Active! is often used as a groupware component in Japanese-language environments of large corporations, universities, government agencies, and banks. According to the vendor, Active! is used in over 2,250 organizations , boasting over 11,000,000 accounts, making it a significant player in the country's business webmail market. Late last week, Qualitia released a security bulletin about a stack-based buffer overflow vulnerability tracked under CVE-2025-42599 (CVSS v3 score: 9.8, \"critical\") impacting all versions of Active! up to and including 'BuildInfo: 6.60.05008561' on all supported OS platforms. \"If a maliciously crafted request is sent by a remote third party, there is a possibility of arbitrary code execution or a denial-of-service (DoS) condition being triggered,\" reads the bulletin . Although Qualitia mentions investigating whether the flaw has been exploited, Japan's CERT has confirmed its active exploitation status , urging all users to update to Active! Mail 6 BuildInfo: 6.60.06008562 as soon as possible. Japanese web hosting and IT services (SMB) provider Kagoya Japan reported several external attacks over the weekend, prompting it to temporarily suspend the service. \"We suspect that this issue is related to a vulnerability disclosed by QUALITIA (the developer),\" reads the bulletin Kagoya published earlier . A similar service outage following believed exploitation attempts was also reported by web hosting and IT services provider WADAX. \"At this stage, we cannot yet guarantee the safe use of the service for our customers,\" announced WADAX . \"Therefore, with customer safety as our top priority, we have temporarily suspended the Active! mail service as a precaution.\" Macnica security researcher Yutaka Sejiyama told BleepingComputer that at least 227 internet-exposed Active! servers that are potentially exposed to these attacks, with 63 of them used in universities. Japan's CERT has proposed specific mitigation steps for those unable to apply the security update immediately, including configuring the Web Application Firewall (WAF) to enable HTTP request body inspection and block multipart/form-data headers if their size exceeds a certain threshold. Update 4/23 - Japanese internet services provider IIJ has also announced it was impacted by attacks targeting CVE-2025-42599, compromising customer information . The attacks were first detected on April 15 , indicating exploitation of the flaw as a zero-day. SAP fixes suspected NetWeaver zero-day exploited in attacks Critical RCE flaw in Apache Tomcat actively exploited in attacks Critical PHP RCE vulnerability mass exploited in new attacks Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw CISA flags Craft CMS code injection flaw as exploited in attacks Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Enhancing your DevSecOps with Wazuh, the open source XDR platform Overdue a password health-check? Audit your Active Directory for free Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-32433"
    ],
    "cve_counts": {
      "CVE-2025-32433": 1
    },
    "title": "Critical Erlang/OTP SSH RCE bug now has public exploits, patch now",
    "permalink": "https://www.bleepingcomputer.com/news/security/public-exploits-released-for-critical-erlang-otp-ssh-flaw-patch-now/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Public exploits are now available for a critical Erlang/OTP SSH vulnerability tracked as CVE-2025-32433, allowing unauthenticated attackers to remotely execute code on impacted devices. Researchers at the Ruhr University Bochum in Germany disclosed the flaw on Wednesday, warning that all devices running the daemon were vulnerable. \"The issue is caused by a flaw in the SSH protocol message handling which allows an attacker to send connection protocol messages prior to authentication,\" reads a disclosure on the OpenWall vulnerability mailing list. The flaw was fixed in versions 25.3.2.10 and 26.2.4, but as the paltform is commonly used in telecom infrastructure, databases, and high-availability systems, it may not be easy to update devices immediately. However, the situation has become more urgent, as multiple cybersecurity researchers have privately created exploits that achieve remote code execution on vulnerable devices. This includes Peter Girnus of the Zero Day Initiative and researchers from Horizon3, who said the flaw was surprisingly easy to exploit . Soon after, PoC exploits were published on GitHub by ProDefense, and another was published anonymously on Pastebin, with both quickly shared on social media. Girnus confirmed to BleepingComputer that ProDefense's PoC is valid but was not able to successfully exploit Erlang/OTP SSH using the one posted to Pastebin. Now that public exploits are available, threat actors will soon begin scanning for vulnerable systems and exploiting them. \"SSH is the most commonly used remote access management protocol so I expect this combination to be widespread in critical infrastructure,\" Girnus told BleepingComputer. \"It's a bit concerning especially considering how frequently telcos are targeted by nation state APTs such as Volt and Salt Typhoon for example.\" Girnus refers to the Chinese state-sponsored hacking groups responsible for hacking edge networking equipment and breaching telecommunications providers in the US and worldwide. According to Shodan query shared by Girnus, there are over 600,000 IP addresses running Erlang/OTP. However, the researcher says the majority of these devices are running CouchDB, which is not impacted by the vulnerability. An Apache CouchDB representative also confirmed to BleepingComputer that CouchDB does not use the SSH server or client features from Erlang/OTP, so is not vulnerable. Now that public exploits are available, it is strongly advised that all devices running Erlang OTP SSH be upgraded immediately before threat actors compromise them. Update 4/21/25: Updated to explain that CouchDB is not vulnerable to this flaw. Critical Erlang/OTP SSH pre-auth RCE is 'Surprisingly Easy' to exploit, patch now CISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks SAP fixes suspected NetWeaver zero-day exploited in attacks Craft CMS RCE exploit chain used in zero-day attacks to steal data CISA flags Craft CMS code injection flaw as exploited in attacks Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Enhancing your DevSecOps with Wazuh, the open source XDR platform Overdue a password health-check? Audit your Active Directory for free Rethinking Automated Penetration Testing: Why Validation Changes Everything Learn why identity attacks were the #1 threat facing organizations in 2024 Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-2492"
    ],
    "cve_counts": {
      "CVE-2025-2492": 2
    },
    "title": "ASUS warns of critical auth bypass flaw in routers using AiCloud",
    "permalink": "https://www.bleepingcomputer.com/news/security/asus-warns-of-critical-auth-bypass-flaw-in-routers-using-aicloud/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  ASUS is warning about an authentication bypass vulnerability in routers with AiCloud enabled that could allow remote attackers to perform unauthorized execution of functions on the device. The vulnerability, tracked under CVE-2025-2492 and rated critical (CVSS v4 score: 9.2), is remotely exploitable via a specially crafted request and requires no authentication, making it particularly dangerous. \"An improper authentication control vulnerability exists in certain ASUS router firmware series,\" reads the vendor's bulletin . \"This vulnerability can be triggered by a crafted request, potentially leading to unauthorized execution of functions.\" AiCloud is a cloud-based remote access feature built into many ASUS routers, turning them into mini private cloud servers. It allows users to access files stored on USB drives connected to the router from anywhere over the internet, stream media remotely, sync files between home networks and other cloud storage services, and share files with others via links. The vulnerability discovered in AiCloud impacts a broad range of models, with ASUS releasing fixes for multiple firmware branches, including 3.0.0.4_382 series, 3.0.0.4_386 series, 3.0.0.4_388 series, and 3.0.0.6_102 series. Users are recommended to upgrade to the latest firmware version available for their model, which they can find on the vendor's support portal or the product finder page . Detailed instructions on how to apply firmware updates are available here . ASUS also advises users to use distinct passwords to secure their wireless network and router administration page, and make sure they're at least 10 characters long with a mix of letters, numbers, and symbols. Impacted users of end-of-life products are advised to disable AiCloud entirely and turn off internet access for WAN, port forwarding, DDNS, VPN server, DMZ, port triggering, and FTP services. While there are no reports of active exploitation or a public proof-of-concept exploit for CVE-2025-2492, attackers commonly target these flaws to infect devices with malware or recruit them into DDoS swarms. Therefore, it is strongly advised that ASUS router users upgrade to the latest firmware as soon as possible. ASUS releases fix for AMI bug that lets hackers brick servers SAP fixes suspected NetWeaver zero-day exploited in attacks Hackers exploit WordPress plugin auth bypass hours after disclosure New Mirai botnet behind surge in TVT DVR exploitation Newest Ivanti SSRF zero-day now under mass exploitation So tell me again. What are the advantages of all this cloud tom-foolery and AI buzzword BS? Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything Overdue a password health-check? Audit your Active Directory for free View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Learn why identity attacks were the #1 threat facing organizations in 2024 Enhancing your DevSecOps with Wazuh, the open source XDR platform Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2021-20035"
    ],
    "cve_counts": {
      "CVE-2021-20035": 3
    },
    "title": "SonicWall SMA VPN devices targeted in attacks since January",
    "permalink": "https://www.bleepingcomputer.com/news/security/sonicwall-sma-vpn-devices-targeted-in-attacks-since-january/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  A remote code execution vulnerability affecting SonicWall Secure Mobile Access (SMA) appliances has been under active exploitation since at least January 2025, according to cybersecurity company Arctic Wolf. This security flaw ( CVE-2021-20035 ) impacts SMA 200, SMA 210, SMA 400, SMA 410, and SMA 500v devices and was patched almost four years ago, in September 2021, when SonicWall said it could only be exploited to take down vulnerable appliances in denial-of-service (DoS) attacks. However, the company updated the four-year-old security advisory on Monday to flag the security bug as exploited in attacks , expand the impact to include remote code execution, and upgrade the CVSS severity score from medium to high severity. \"This vulnerability is believed to be actively exploited in the wild. As a precautionary measure, SonicWall PSIRT has updated the summary and revised the CVSS score to 7.2,\" SonicWall said. Successful exploitation can allow remote threat actors with low privileges to exploit an \"improper neutralization of special elements in the SMA100 management interface\" to inject arbitrary commands as a 'nobody' user and execute arbitrary code in low-complexity attacks. CISA has also added the vulnerability to its Known Exploited Vulnerabilities catalog , confirming it's now being abused in the wild and ordering Federal Civilian Executive Branch (FCEB) agencies to secure their networks against ongoing attacks until May 7th. Days after SonicWall tagged the security bug as exploited in the wild without sharing when the attacks started, cybersecurity company Arctic Wolf reported that threat actors used CVE-2021-20035 exploits in attacks as early as January 2025. In this campaign, the attackers have also used a local super admin account with a \"password\" default password to target SMA 100 appliances with the management interface exposed online. \"Arctic Wolf has identified an ongoing VPN credential access campaign targeting SMA 100 series appliances, with a starting timeframe as early as January 2025, extending into April 2025,\" the cybersecurity firm said . \"One noteworthy aspect of the campaign was the use of a local super admin account (admin@LocalDomain) on these appliances, which has an insecure default password of password.\" To block CVE-2021-20035 attacks targeting their SonicWall appliances, Arctic Wolf advised network defenders to limit VPN access to the minimum necessary accounts, deactivate unneeded accounts, enable multi-factor authentication for all accounts, and reset passwords for all local accounts on SonicWall SMA firewalls. In February, SonicWall also urged customers in January to patch a critical vulnerability affecting SMA1000 secure access gateways following reports that it had already been exploited in zero-day attacks and, one month later, warned of an actively exploited authentication bypass flaw in Gen 6 and Gen 7 firewalls that can let hackers hijack VPN sessions . CISA tags SonicWall VPN flaw as actively exploited in attacks SonicWall: SMA100 VPN vulnerabilities now exploited in attacks Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw SAP fixes suspected NetWeaver zero-day exploited in attacks Active! Mail RCE flaw exploited in attacks on Japanese orgs Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Enhancing your DevSecOps with Wazuh, the open source XDR platform Rethinking Automated Penetration Testing: Why Validation Changes Everything Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2021-40449",
      "CVE-2017-11882"
    ],
    "cve_counts": {
      "CVE-2021-40449": 1,
      "CVE-2017-11882": 1
    },
    "title": "Chinese hackers target Russian govt with upgraded RAT malware",
    "permalink": "https://www.bleepingcomputer.com/news/security/chinese-hackers-target-russian-govt-with-upgraded-rat-malware/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Chinese-speaking IronHusky hackers are targeting Russian and Mongolian government organizations using upgraded MysterySnail remote access trojan (RAT) malware. Security researchers at Kaspersky's Global Research and Analysis Team (GReAT) spotted the updated implant while investigating recent attacks where the attackers deployed the RAT malware using a malicious MMC script camouflaged as a Word document, which downloaded second-stage payloads and gained persistence on compromised systems. One of the malicious payloads is an unknown intermediary backdoor that helps transfer files between the command and control servers and hacked devices, run command shells, create new processes, delete files, and more. \"In our telemetry, these files turned out to leave footprints of the MysterySnail RAT malware, an implant we described back in 2021. In observed infection cases, MysterySnail RAT was configured to persist on compromised machines as a service,\" Kaspersky said . \"Notably, a short time after we blocked the recent intrusions related to MysterySnail RAT, we observed the attackers to continue conducting their attacks, by deploying a repurposed and more lightweight version of MysterySnail RAT. This version consists of a single component, and that's why we dubbed it MysteryMonoSnail.\" As they found, the upgraded RAT malware supports dozens of commands, allowing attackers to manage services on the compromised device, execute shell commands, spawn and kill processes, and manage files, among other things. This latest backdoor version is similar to the original MysterySnail RAT, which Kaspersky first detected in late August 2021 in widespread espionage attacks against IT companies, military/defense contractors, and diplomatic entities in Russia and Mongolia. At the time, the IronHusky hacking group was observed deploying the malware on systems compromised using zero-day exploits targeting a Windows Win32k kernel driver vulnerability ( CVE-2021-40449 ). The Chinese APT was first spotted by Kaspersky in 2017 while investigating a campaign targeting Russian and Mongolian government entities with the end goal of collecting intelligence on Russian-Mongolian military negotiations. One year later, Kaspersky also observed them exploiting a Microsoft Office memory corruption vulnerability ( CVE-2017-11882 ) to spread RATs typically used by Chinese hacking groups, including PoisonIvy and PlugX. The Kaspersky report published on Thursday includes indicators of compromise and additional technical details about IronHusky's recent attacks using the MysterySnail RAT. New ResolverRAT malware targets pharma and healthcare orgs worldwide Microsoft: New RAT malware used for crypto theft, reconnaissance France ties Russian APT28 hackers to 12 cyberattacks on French orgs Ivanti zero-day attacks infected devices with custom malware We Smell a (DC)Rat: Revealing a Sophisticated Malware Delivery Chain Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free Enhancing your DevSecOps with Wazuh, the open source XDR platform Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-20178",
      "CVE-2025-20150",
      "CVE-2024-20439",
      "CVE-2025-20236"
    ],
    "cve_counts": {
      "CVE-2025-20178": 1,
      "CVE-2025-20150": 1,
      "CVE-2024-20439": 2,
      "CVE-2025-20236": 1
    },
    "title": "Cisco Webex bug lets hackers gain code execution via meeting links",
    "permalink": "https://www.bleepingcomputer.com/news/security/cisco-webex-bug-lets-hackers-gain-code-execution-via-meeting-links/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Cisco has released security updates for a high-severity Webex vulnerability that allows unauthenticated attackers to gain client-side remote code execution using malicious meeting invite links. Tracked as CVE-2025-20236, this security flaw was found in the Webex custom URL parser and can be exploited by tricking users into downloading arbitrary files, which lets threat actors execute arbitrary commands on systems running unpatched software in low complexity attacks. \"This vulnerability is due to insufficient input validation when Cisco Webex App processes a meeting invite link,\" Cisco explained in a security advisory released this week. \"An attacker could exploit this vulnerability by persuading a user to click a crafted meeting invite link and download arbitrary files. A successful exploit could allow the attacker to execute arbitrary commands with the privileges of the targeted user.\" This security bug impacts Cisco Webex App installations regardless of operating system or system configuration. There are no workarounds, so software updates are required to block potential exploitation attempts. This week, Cisco also released security patches for a privilege escalation flaw ( CVE-2025-20178 ) in Secure Network Analytics' web-based management interface, which can let attackers with admin credentials run arbitrary commands as root. Cisco also addressed a Nexus Dashboard vulnerability ( CVE-2025-20150 ) that allows unauthenticated attackers to enumerate LDAP user accounts remotely and determine which usernames are valid. However, the company's Product Security Incident Response Team (PSIRT) found no proof-of-concept exploits in the wild and no evidence of malicious activity targeting systems unpatched against security flaws fixed this Wednesday. Earlier this month, Cisco also warned admins to patch a critical Cisco Smart Licensing Utility (CSLU) static credential vulnerability (CVE-2024-20439) that exposes a built-in backdoor admin account and is now actively exploited in attacks . In late March, CISA added the CVE-2024-20439 flaw to its Known Exploited Vulnerabilities Catalog and ordered U.S. federal agencies to secure their networks against ongoing attacks within three weeks by April 21. Apple 'AirBorne' flaws can lead to zero-click AirPlay RCE attacks Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw SAP fixes suspected NetWeaver zero-day exploited in attacks Active! Mail RCE flaw exploited in attacks on Japanese orgs SonicWall SMA VPN devices targeted in attacks since January Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Enhancing your DevSecOps with Wazuh, the open source XDR platform Overdue a password health-check? Audit your Active Directory for free View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Learn why identity attacks were the #1 threat facing organizations in 2024 Rethinking Automated Penetration Testing: Why Validation Changes Everything Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-32433"
    ],
    "cve_counts": {
      "CVE-2025-32433": 3
    },
    "title": "Critical Erlang/OTP SSH pre-auth RCE is 'Surprisingly Easy' to exploit, patch now",
    "permalink": "https://www.bleepingcomputer.com/news/security/critical-erlang-otp-ssh-pre-auth-rce-is-surprisingly-easy-to-exploit-patch-now/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  A critical vulnerability in the Erlang/OTP SSH, tracked as CVE-2025-32433, has been disclosed that allows for unauthenticated remote code execution on vulnerable devices. The flaw was discovered by Fabian Bäumer, Marcus Brinkmann, Marcel Maehren, and Jörg Schwenk of the Ruhr University Bochum in Germany and given a maximum severity score of 10.0. All devices running the Erlang/OTP SSH daemon are impacted by the vulnerability and are advised to upgrade to versions 25.3.2.10 and 26.2.4 to fix the flaw. Erlang is a programming language known for its fault-tolerance and concurrency, making it commonly used in telecom infrastructure and high -availability systems. Erlang/OTP is a set of libraries, design principles, and tools built on top of Erlang that provides components like the SSH application for remote access. The CVE-2025-32433 vulnerability is caused by the improper handling of certain pre-authentication protocol messages within the SSH daemon provided by Erlang/OTP's SSH application. \"The issue is caused by a flaw in the SSH protocol message handling which allows an attacker to send connection protocol messages prior to authentication,\" reads a disclosure on the OpenWall vulnerability mailing list. Any commands executed through the vulnerability will be run with the same privileges as the SSH daemon. In many cases, the daemon runs as root, which would allow attackers to fully compromise the system. Horizon3's Attack Team, known for their exploit research, warned on X that they had reproduced the flaw and found it \"surprisingly easy,\" demonstrating a PoC that writes a file as root on affected systems. \"Just finished reproducing CVE-2025-32433 and putting together a quick PoC exploit — surprisingly easy. Wouldn't be shocked if public PoCs start dropping soon. If you're tracking this, now's the time to take action,\" Horizon3 posted to X . Organizations are strongly advised to upgrade to the fixed versions immediately before a PoC becomes public and the flaw is mass-exploited. For systems, such as industrial or mission-critical devices that can't be easily updated, it is advised that access to SSH be restricted to trusted IPs, or the SSH daemon should be turned off if not needed. Critical Erlang/OTP SSH RCE bug now has public exploits, patch now SAP fixes suspected NetWeaver zero-day exploited in attacks Active! Mail RCE flaw exploited in attacks on Japanese orgs CentreStack RCE exploited as zero-day to breach file sharing servers WhatsApp flaw can let attackers run malicious code on Windows PCs Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free Enhancing your DevSecOps with Wazuh, the open source XDR platform View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Rethinking Automated Penetration Testing: Why Validation Changes Everything Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-24054"
    ],
    "cve_counts": {
      "CVE-2025-24054": 4
    },
    "title": "Windows NTLM hash leak flaw exploited in phishing attacks on governments",
    "permalink": "https://www.bleepingcomputer.com/news/security/windows-ntlm-hash-leak-flaw-exploited-in-phishing-attacks-on-governments/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  A Windows vulnerability that exposes NTLM hashes using .library-ms files is now actively exploited by hackers in phishing campaigns targeting government entities and private companies. The flaw tracked as CVE-2025-24054 was fixed in Microsoft's March 2025 Patch Tuesday . Initially, it was not marked as actively exploited and was assessed as 'less likely' to be. However, Check Point researchers report having observed active exploitation activity for CVE-2025-24054 only a few days after patches became available, culminating between March 20 and 25, 2025. Although one IP address behind these attacks was previously linked to the Russia state-sponsored threat group APT28 ('Fancy Bear'), it is not enough evidence for confident attribution. NTLM (New Technology LAN Manager) is a Microsoft authentication protocol that uses challenge-response negotiation involving hashes instead of transmitting plaintext passwords to authenticate users. While NTLM avoids transmitting plaintext passwords, it is no longer considered secure due to vulnerabilities like replay attacks and brute-force cracking of captured hashes . Due to this, Microsoft has begun phasing out NTLM authentication in favor of Kerberos or Negotiate. In attacks seen by Check Point, phishing emails were sent to entities in Poland and Romania that included a Dropbox link to a ZIP archive, containing a .library-ms file. A library-ms file is a legitimate file type that, when opened, shows a Windows library , or virtual container, that contains files and folders from different configured sources. In this phishing attack, the library-ms file was created to contain a path to a remote SMB server under the attacker's control. When extracting a ZIP file that contains a .library-ms file, Windows Explorer will interact with it automatically, triggering the CVE-2025-24054 flaw and causing Windows to make an SMB connection to the URL specified in the file. When Windows connects to the remote SMB server, it will attempt to authenticate via NTLM, allowing the attacker to capture the user's NTLM hashes. In a later campaign, Check Point discovered phishing emails that contained .library-ms attachments, without an archive. Simply downloading the .library-ms file was enough to trigger NTLM authentication to the remote server, demonstrating that archives were not required to exploit the flaw. \"On March 25, 2025, Check Point Research discovered a campaign targeting companies around the world, distributing these files without being zipped,\" explains Check Point . \"According to Microsoft, this exploit is triggered with minimal user interaction with a malicious file, such as selecting (single-clicking), inspecting (right-clicking), or performing any action other than opening or executing the file.\" The malicious archive also contains three more files, namely 'xd.url,' 'xd.website,' and 'xd.link,' which leverage older NTLM hash leak flaws and are most likely included for redundancy in case the 'library-ms' method fails. Check Point says the attacker-controlled SMB servers in this campaign were using the 159.196.128[.]120 and 194.127.179[.]157 IP addresses. Capturing NTLM hashes could open the way to authentication bypass and privilege escalation, so even though CVE-2025-24054 is only evaluated as a \"medium\" severity issue, its potential consequences are grave. Given the low interaction required to exploit, organizations should treat this as a high-risk issue. It is advised that all organizations should install the March 2025 updates and turn off NTLM authentication if it is not required. New Mirai botnet behind surge in TVT DVR exploitation New Windows zero-day exploited by 11 state hacking groups since 2017 Critical PHP RCE vulnerability mass exploited in new attacks CISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks SAP fixes suspected NetWeaver zero-day exploited in attacks Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Overdue a password health-check? Audit your Active Directory for free Learn why identity attacks were the #1 threat facing organizations in 2024 Enhancing your DevSecOps with Wazuh, the open source XDR platform Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2021-20035"
    ],
    "cve_counts": {
      "CVE-2021-20035": 2
    },
    "title": "CISA tags SonicWall VPN flaw as actively exploited in attacks",
    "permalink": "https://www.bleepingcomputer.com/news/security/cisa-tags-sonicwall-vpn-flaw-as-actively-exploited-in-attacks/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  On Wednesday, CISA warned federal agencies to secure their SonicWall Secure Mobile Access (SMA) 100 series appliances against attacks exploiting a high-severity remote code execution vulnerability. Tracked as CVE-2021-20035 , this security flaw impacts SMA 200, SMA 210, SMA 400, SMA 410, and SMA 500v (ESX, KVM, AWS, Azure) devices. Successful exploitation can allow remote threat actors with low privileges to execute arbitrary code in low-complexity attacks. \"Improper neutralization of special elements in the SMA100 management interface allows a remote authenticated attacker to inject arbitrary commands as a 'nobody' user, which could potentially lead to code execution,\" SonicWall explains in an advisory updated this week. SonicWall patched this vulnerability almost four years ago, in September 2021, when the company said it could only be exploited to take down vulnerable appliances in denial-of-service (DoS) attacks. However, on Monday, it updated the CVE-2021-20035 security advisory to flag it as exploited in attacks, upgrade the CVSS severity score from medium to high, and expand the impact to include code execution. \"This vulnerability is believed to be actively exploited in the wild. As a precautionary measure, SonicWall PSIRT has updated the summary and revised the CVSS score to 7.2,\" SonicWall said. Yesterday, CISA confirmed the vulnerability is now being abused in the wild by adding it to the Known Exploited Vulnerabilities catalog , which lists security flaws flagged by the cybersecurity agency as actively exploited in attacks. As mandated by the Binding Operational Directive (BOD) 22-01 issued in November 2021, Federal Civilian Executive Branch (FCEB) agencies now have three weeks, until May 7th, to secure their networks against ongoing attacks. While BOD 22-01 only applies to U.S. federal agencies, all network defenders should prioritize patching this security vulnerability as soon as possible to block potential breach attempts. \"These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise,\" CISA warned . In February, SonicWall also warned of an actively exploited authentication bypass flaw in Gen 6 and Gen 7 firewalls that could let hackers hijack VPN sessions . One month earlier, the company urged customers to patch a critical vulnerability affecting SMA1000 secure access gateways following reports that it had already been exploited in zero-day attacks. SonicWall SMA VPN devices targeted in attacks since January Critical Ivanti RCE flaw with public exploit now used in attacks Over 1,200 SAP NetWeaver servers vulnerable to actively exploited flaw SAP fixes suspected NetWeaver zero-day exploited in attacks CISA flags Craft CMS code injection flaw as exploited in attacks Given CISA now has a major blindspot to Russia, we no longer rely on it as a credible cybersecurity source. Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Enhancing your DevSecOps with Wazuh, the open source XDR platform Rethinking Automated Penetration Testing: Why Validation Changes Everything Overdue a password health-check? Audit your Active Directory for free Learn why identity attacks were the #1 threat facing organizations in 2024 View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-24200",
      "CVE-2025-24201",
      "CVE-2025-24085",
      "CVE-2025-31201",
      "CVE-2025-31200"
    ],
    "cve_counts": {
      "CVE-2025-24200": 1,
      "CVE-2025-24201": 1,
      "CVE-2025-24085": 1,
      "CVE-2025-31201": 2,
      "CVE-2025-31200": 2
    },
    "title": "Apple fixes two zero-days exploited in targeted iPhone attacks",
    "permalink": "https://www.bleepingcomputer.com/news/security/apple-fixes-two-zero-days-exploited-in-targeted-iphone-attacks/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Apple released emergency security updates to patch two zero-day vulnerabilities that were used in an \"extremely sophisticated attack\" against specific targets' iPhones. The two vulnerabilities are in CoreAudio (CVE-2025-31200) and RPAC (CVE-2025-31201), with both bugs impacting iOS, macOS, tvOS, iPadOS, and visionOS. \"Apple is aware of a report that this issue may have been exploited in an extremely sophisticated attack against specific targeted individuals on iOS,\" reads an Apple security bulletin released today. The CVE-2025-31200 flaw in CoreAudio was discovered by Apple and the Google Threat Analysis team. It can be exploited by processing an audio stream in a maliciously crafted media file to execute remote code on the device. The company also fixed CVE-2025-31201, which Apple discovered. It is a bug in RPAC that allows attackers with read or write access to bypass Pointer Authentication (PAC), an iOS security feature that helps protect against memory vulnerabilities. Apple has not shared further details on how the flaws were exploited in attacks. BleepingComputer contacted Apple and Google with questions about flaws but has not received a response. Both vulnerabilities were fixed in iOS 18.4.1 , iPadOS 18.4.1 , tvOS 18.4.1 , macOS Sequoia 15.4.1 , and visionOS 2.4.1 . The list of devices impacted by these zero-days is extensive, impacting older and newer models: Even though these zero-day flaws were exploited in highly targeted attacks, users are still strongly advised to install them as soon as possible. With these vulnerabilities, Apple has fixed five zero-days since the start of the year, the first in January (CVE-2025-24085), the second in February (CVE-2025-24200), and the third in March (CVE-2025-24201). Apple fixes WebKit zero-day exploited in ‘extremely sophisticated’ attacks Apple backports zero-day patches to older iPhones and Macs Apple 'AirBorne' flaws can lead to zero-click AirPlay RCE attacks SAP fixes suspected NetWeaver zero-day exploited in attacks Craft CMS RCE exploit chain used in zero-day attacks to steal data Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything Learn why identity attacks were the #1 threat facing organizations in 2024 View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Enhancing your DevSecOps with Wazuh, the open source XDR platform Overdue a password health-check? Audit your Active Directory for free Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2023-27997",
      "CVE-2024-21762",
      "CVE-2022-42475"
    ],
    "cve_counts": {
      "CVE-2023-27997": 1,
      "CVE-2024-21762": 1,
      "CVE-2022-42475": 1
    },
    "title": "Fortinet: Hackers retain access to patched FortiGate VPNs using symlinks",
    "permalink": "https://www.bleepingcomputer.com/news/security/fortinet-hackers-retain-access-to-patched-fortigate-vpns-using-symlinks/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Fortinet warns that threat actors use a post-exploitation technique that helps them maintain read-only access to previously compromised FortiGate VPN devices even after the original attack vector was patched. Earlier this week, Fortinet began sending emails to customers warning that their FortiGate/FortiOS devices were compromised based on telemetry received from FortiGuard devices. These emails were titled \"Notification of device compromise - FortiGate / FortiOS - ** Urgent action required **,\" given a TLP:AMBER+STRICT designation. \"This issue is not related to any new vulnerability. This file was left behind by a threat actor following exploitation of previous known vulnerabilities,\" the emails said, including but not limited to CVE-2022-42475 , CVE-2023-27997 , and CVE-2024-21762 . After BleepingComputer contacted Fortinet with questions about these emails, the company released an advisory on Thursday warning about this new exploitation technique. The advisory says that when the threat actors previously breached servers using older vulnerabilities, they created symbolic links in the language files folder to the root file system on devices with SSL-VPN enabled. This allows them to maintain read-only access to the root filesystem through the publicly accessible SSL-VPN web panel even after they're discovered and evicted. \"A threat actor used a known vulnerability to implement read-only access to vulnerable FortiGate devices. This was achieved via creating a symbolic link connecting the user filesystem and the root filesystem in a folder used to serve language files for the SSL-VPN. This modification took place in the user filesystem and avoided detection,\" Fortinet says . \"Therefore, even if the customer device was updated with FortiOS versions that addressed the original vulnerabilities, this symbolic link may have been left behind, allowing the threat actor to maintain read-only access to files on the device's file system, which may include configurations.\" While Fortinet didn't reveal the exact timeframe of these attacks, the Computer Emergency Response Team of France (CERT-FR), part of the country's National Agency for the Security of Information Systems (ANSSI), revealed on Thursday that this technique has been used in a massive wave of attacks going back to early 2023. \"CERT-FR is aware of a massive campaign involving numerous compromised devices in France. During incident response operations, CERT-FR has learned of compromises occurring since early 2023,\" CERT-FR said . Today, CISA also advised network defenders to report any incidents and anomalous activity related to Fortinet's report to its 24/7 Operations Center at Report@cisa.gov or (888) 282-0870. In the emails sent earlier this week, Fortinet advised customers to immediately upgrade their FortiGuard firewalls to the latest version of FortiOS (7.6.2, 7.4.7, 7.2.11, 7.0.17, 6.4.16) to remove the malicious files used for persistence. Admins were also urged to review device configurations immediately and focus on finding any unexpected changes. This support document provides further guidance on resetting potentially exposed credentials on compromised devices. CERT-FR also recommended isolating compromised VPN devices from the network, resetting all secrets (credentials, certificates, identity tokens, cryptographic keys, etc), and searching for evidence of lateral network movement. Over 16,000 Fortinet devices compromised with symlink backdoor SonicWall SMA VPN devices targeted in attacks since January SonicWall: SMA100 VPN vulnerabilities now exploited in attacks Protect your devices and data with this $40 five-year AdGuard VPN plan Kali Linux warns of update failures after losing repo signing key Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 Rethinking Automated Penetration Testing: Why Validation Changes Everything Overdue a password health-check? Audit your Active Directory for free View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Enhancing your DevSecOps with Wazuh, the open source XDR platform Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-21204"
    ],
    "cve_counts": {
      "CVE-2025-21204": 2
    },
    "title": "Microsoft: Windows 'inetpub' folder created by security fix, don’t delete",
    "permalink": "https://www.bleepingcomputer.com/news/security/microsoft-windows-inetpub-folder-created-by-security-fix-dont-delete/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Microsoft has now confirmed that an April 2025 Windows security update is creating a new empty \"inetpub\" folder and warned users not to delete it. This folder is typically used by Microsoft's Internet Information Services (IIS), a web server platform that can be enabled via the Windows Features dialog to host websites and web apps. However, after installing this month's cumulative updates, many Windows users have found a newly created C:\\inetpub folder on their systems, although IIS wasn't installed during the process. BleepingComputer has confirmed this behavior on our Windows 11 and Windows 10 systems and discovered that the cumulative update creates the folder using the SYSTEM account. Even though deleting the folder did not cause issues using Windows in our tests, Microsoft told BleepingComputer on Thursday that this empty folder had been intentionally created and should not be removed. However, according to user reports , the April cumulative updates will fail to install if the C:\\inetpub directory is created before update deployment. While Redmond still has to explain why the security updates are creating this folder in the first place, the company updated the advisory for a Windows Process Activation elevation of privilege vulnerability (tracked as CVE-2025-21204 ) overnight to warn users not to delete the new empty inetpub folder on their hard drives. \"After installing the updates listed in the Security Updates table for your operating system, a new %systemdrive%\\inetpub folder will be created on your device,\" Microsoft says . \"This folder should not be deleted regardless of whether Internet Information Services (IIS) is active on the target device. This behavior is part of changes that increase protection and does not require any action from IT admins and end users.\" The CVE-2025-21204 security flaw is caused by an improper link resolution issue before file access ('link following') in the Windows Update Stack which likely means that, on unpatched devices, Windows Update may follow symbolic links in a way that can let local attackers trick the system into accessing or modifying unintended files or folders. The company warns that successful exploitation can let local attackers with low privileges escalate permissions and \"perform and/or manipulate file management operations on the victim machine in the context of the NT AUTHORITYSYSTEM account.\" For those who deleted the inetpub folder, you can recreate it by going into the Windows \"Turn Windows Features on or off\" control panel and installing Internet Information Services.  Once installed, a new inetpub folder will be created in the root of the C: drive, this time with files in it. However, it will have the same SYSTEM ownership as the folder created by the recent Windows security update. If you do not use IIS, you can uninstall it again through the same Windows Features control panel and reboot your computer when prompted. This will remove the software but leave the C:\\inetpub folder behind. Microsoft has confirmed that this method will recreate the folder with the same protections. Windows \"inetpub\" security fix can be abused to block future updates Microsoft April 2025 Patch Tuesday fixes exploited zero-day, 134 flaws Microsoft adds hotpatching support to Windows 11 Enterprise Microsoft March 2025 Patch Tuesday fixes 7 zero-days, 57 flaws Windows 11 April update unexpectedly creates new 'inetpub' folder No one else is suspicious of this? We created a new folder on your drive. This folder is empty. The folder name is typically associated with a buggy piece of software. Do not delete this empty folder or something something something may happen. Something they ARE doing, or perhaps will be doing, relies on it. Otherwise they would not say to not delete it.  Considering that it is normally associated with a web server, there is no doubt in my mind that they are, or intend to, serve more information FROM your PC to points unknown. \"No one else is suspicious of this? We created a new folder on your drive. This folder is empty. The folder name is typically associated with a buggy piece of software. Do not delete this empty folder or something something something may happen. Something they ARE doing, or perhaps will be doing, relies on it. Otherwise they would not say to delete it.  Considering that it is normally associated with a web server, there is no doubt in my mind that they are, or intend to, serve more information FROM your PC to points unknown.\" Keep an eye on this folder on future updates. The next step will be installing IIS on every Win10/11 install. I suspect that sometime down the track this will be needed either for some crap-pilot stuff and / or the screenshit (sic.) all your stuff so they can slurp it up. I deleted it. It came back post reboot. No harm done, and the end of the world didn't happen. All good! If they need it for security then why not put a message to that effect during the restart sequence? Surely that is what an honest and responsible vendor would do? You guys are paranoid. If you really want to be safe paranoid: \"format c: /q\" Because Microsoft has always proven itself to be trustworthy? They said not to delete the folder. They didn't say not to rename it. :) So what happens if you already have this folder, IIS is not installed but the folder contains a web site with images and CSS. I use it that way for a home page. Each PC has it. When I refresh PCs the website is also refreshed to update if I've made changes. It's presence didn't cause any failure of the update. It installed fine. Windows 10 21H2 19044.5737. I just updated and folder appeared but this folder is not empty for me. C:\\inetpub\\DeviceHealthAttestation\\bin\\hassrv.dll Absolutely not recreating it. M$ should develop a fix other than creating folders for not-installed software. Thank you Bleeping Computer for detailing this out, especially what Microsoft's claims are for consequences/why not to delete it, and for including how to restore it properly. There are loads of hidden folders on Windows computers, ones that at least aren't seen based on default File Explorer view settings.  Heck, there's probably not a single person that knows what every single folder in Windows is for (obviously not a problem thanks to documentation).  Not sure what all the paranoia is for; if Microsoft says it's for security, it's probably true.  I say this as a CVE was referenced. i deleted it ,I am a computer engineer, , there is no way an empty folder can do anything, ,seems the article was written by someone in a call center,, i worked at MS in 2006 and that was how it was then too,, this is a bunch of whooy, if they need the folder they will put it back with some files in it,, I deleted it last week. I put it back with the instructions above. When I uninstalled, the folder disappeared. I re-installed IIS. I then added a blank file \"do not delete.txt\" and then uninstalled. Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Overdue a password health-check? Audit your Active Directory for free Learn why identity attacks were the #1 threat facing organizations in 2024 Enhancing your DevSecOps with Wazuh, the open source XDR platform Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-3102"
    ],
    "cve_counts": {
      "CVE-2025-3102": 2
    },
    "title": "Hackers exploit WordPress plugin auth bypass hours after disclosure",
    "permalink": "https://www.bleepingcomputer.com/news/security/hackers-exploit-wordpress-plugin-auth-bypass-hours-after-disclosure/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Hackers started exploiting a high-severity flaw that allows bypassing authentication in the OttoKit (formerly SureTriggers) plugin for WordPress just hours after public disclosure. Users are strongly recommended to upgrade to the latest version of OttoKit/SureTriggers, currently 1.0.79, released at the beginning of the month. The OttoKit WordPress plugin allows users to connect plugins and external tools like WooCommerce, Mailchimp, and Google Sheets, automate tasks like sending emails and adding users, or updating CRMs without code. Statistics show that the product is active on 100,000 websites. Yesterday, Wordfence disclosed an authentication bypass vulnerability in OttoKit, identified as CVE-2025-3102. The flaw impacts all versions of SureTriggers/OttoKit up to 1.0.78. The flaw stems from a missing empty value check in the authenticate_user() function, which handles REST API authentication. Exploitation to be possible if the plugin is not configured with an API key, which causes the stored secret_key to remain empty. An attacker could exploit this by sending an empty st_authorization header to pass the check and grant unauthorized access to protected API endpoints. Essentially, CVE-2025-3102 allows attackers to create new administrator accounts without authentication, posing a high risk of full site takeover. Wordfence received a report about the flaw from security researcher 'mikemyers', who earned a bounty of $1,024 for the discovery in mid-March. The plugin vendor was contacted on April 3 with the full exploitation details, and they released a fix via version 1.0.79 on the same day. However, hackers quickly jumped at the opportunity to exploit the issue, taking advantage of administrators' delay in updating the plugin to address the security problem. Researchers at WordPress security platform Patchstack are warning that the first exploitation attempts in the wild were logged only a few hours after the disclosure of the flaw. “Attackers were quick to exploit this vulnerability, with the first recorded attempt occurring just four hours after it was added as a vPatch to our database,” reports Patchstack . “This swift exploitation highlights the critical need to apply patches or mitigations immediately upon the public disclosure of such vulnerabilities,” the researchers say. The threat actors attempt to create new administrator accounts using randomized username/password and email address combination, a sign of task automation. If you’re using OttoKit/SureTriggers, upgrade to version 1.0.79 as soon as possible and check logs for unexpected admin accounts or other user roles, installation of plugins/themes, database access events, and modification of security settings. SAP fixes suspected NetWeaver zero-day exploited in attacks New Mirai botnet behind surge in TVT DVR exploitation Newest Ivanti SSRF zero-day now under mass exploitation Critical auth bypass bug in CrushFTP now exploited in attacks The 4 WordPress flaws hackers targeted the most in Q1 2025 There isn't any evidence presented that the vulnerability has been exploited, only exploit attempts. That is a particularly important distinction as Wordfence included this important note in their post: \"while over 100,000 sites have this plugin installed and contain the vulnerability, only a small subset of sites will actually be exploitable. This is due to the nature of the vulnerability which requires the plugin to be in an non-configured state for exploitation.\" You neglected to mention Wordfence's disclosure of limited exploitability. Also, the developer disclosed they were fixing a security bug on April 3, so claiming exploitation attempts happened in hours seems misleading, at best. You seem to be parroting Patchstack's misleading claims that looks intended to promote their service instead of providing helpful information. A better takeaway from this would be the importance of WordPress plugin developers getting security reviews done of their software, as the issue could have been addressed before the code got in to a public release of the plugin or earlier. Another better takeaway would be to avoid plugins from the developer of the plugin, Brainstorm Force. That is something we suggested doing over a year ago based on a pattern of bad handling of security: https://www.pluginvulnerabilities.com/2024/01/04/wordpress-plugin-developer-security-advisory-brainstorm-force/ Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Rethinking Automated Penetration Testing: Why Validation Changes Everything Enhancing your DevSecOps with Wazuh, the open source XDR platform Overdue a password health-check? Audit your Active Directory for free Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-21204"
    ],
    "cve_counts": {
      "CVE-2025-21204": 2
    },
    "title": "Windows 11 April update unexpectedly creates new 'inetpub' folder",
    "permalink": "https://www.bleepingcomputer.com/news/microsoft/windows-11-april-update-unexpectedly-creates-new-inetpub-folder/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Update 4/11: Microsoft has now confirmed that the inetpub folder is created as part of a security update. More information in this article . The Windows April 2025 updates are strangely creating an empty \"inetpub\" folder in the root of the C:\\ drive, even on systems that do not have Internet Information Services (IIS) installed. Internet Information Services (IIS) is a web server platform created by Microsoft to host websites, web applications, and services on Windows systems. The platform is not installed by default but can be enabled through the Windows Features dialog. IIS uses the C:\\inetpub folder to store website content, logs, and other server-related files, and it is not normally created on systems without IIS installed. However, this folder is now automatically created on systems where IIS is not installed after installing the Windows 11 KB5055523 and Windows 10 KB5055518 updates and then restarting the computer. BleepingComputer confirmed this behavior on our own Windows 11 and Windows 10 systems, finding the C:\\inetpub folder created after installing the update. Checking the installed Windows Features showed that IIS was not installed during the process, making Windows users question why it was suddenly there.​ The folder is owned by the SYSTEM account, indicating it was created by an elevated process, which in this case was the cumulative update. While the presence of the folder does not impact system performance or stability, its unexpected creation has prompted questions about whether a new feature was introduced with this update or it was simply created by a bug. Deleting the folder has not caused any issues while using Windows in our tests. However, Microsoft told BleepingComputer that the folder was intentionally created and should not be removed. As an empty folder should not have any impact on Windows, especially when IIS is not installed, it should be left alone until we learn more from Microsoft. BleepingComputer contacted Microsoft once again to learn the purpose of the newly created folder. Microsoft: Windows 'inetpub' folder created by security fix, don’t delete Microsoft: March Windows updates mistakenly uninstall Copilot Windows 11 KB5053598 & KB5053602 cumulative updates released Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Windows 11 KB5055627 update released with 30 new changes, fixes Windows 10 22H2 is also affected after the installation of KB5057589. It's proven that raccoons make very bad OS developers. At Microsoft they should stick with chimpanzees as usual. If you look at the KB article you can see that the folder is there by no mistake [OS Security] After installing this update or a later Windows update, a new %systemdrive%\\inetpub folder will be created on your device. This folder should not be deleted regardless of whether Internet Information Services (IIS) is enabled on the target device. This behavior is part of changes that increase protection and does not require any action from IT admins and end users. For more information, see CVE-2025-21204. This was updated overnight to include this information. We put out a new story on how the inetpub folder is related to a security update for CVE-2025-21204: https://www.bleepingcomputer.com/news/security/microsoft-windows-inetpub-folder-created-by-security-fix-dont-delete/ Goddess, who is running things even at MicroWeenie. Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Overdue a password health-check? Audit your Active Directory for free Enhancing your DevSecOps with Wazuh, the open source XDR platform Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Learn why identity attacks were the #1 threat facing organizations in 2024 Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2024-54024",
      "CVE-2024-26013",
      "CVE-2025-24472",
      "CVE-2024-48887",
      "CVE-2024-47575",
      "CVE-2024-55591",
      "CVE-2024-50565"
    ],
    "cve_counts": {
      "CVE-2024-54024": 1,
      "CVE-2024-26013": 1,
      "CVE-2025-24472": 1,
      "CVE-2024-48887": 2,
      "CVE-2024-47575": 1,
      "CVE-2024-55591": 1,
      "CVE-2024-50565": 1
    },
    "title": "Critical FortiSwitch flaw lets hackers change admin passwords remotely",
    "permalink": "https://www.bleepingcomputer.com/news/security/critical-fortiswitch-flaw-lets-hackers-change-admin-passwords-remotely/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Fortinet has released security patches for a critical vulnerability in its FortiSwitch devices that can be exploited to change administrator passwords remotely. The company says Daniel Rozeboom of the FortiSwitch web UI development team discovered the vulnerability ( CVE-2024-48887 ) internally. Unauthenticated attackers can exploit this unverified FortiSwitch GUI password change security flaw (rated with a 9.8/10 severity score) in low-complexity attacks that don't require user interaction. Fortinet says threat actors can change credentials using a specially crafted request sent via the set_password endpoint. \"An unverified password change vulnerability [CWE-620] in FortiSwitch GUI may allow a remote unauthenticated attacker to modify admin passwords via a specially crafted request,\" Fortinet says . CVE-2024-48887 impacts multiple FortiSwitch versions, from FortiSwitch 6.4.0 and up to FortiSwitch 7.6.0, and was addressed in FortiSwitch versions 6.4.15, 7.0.11, 7.2.9, 7.4.5, and 7.6.1. Cybersecurity company Censys says it found 864 exposed FortiSwitch instances online. However, no information is available on how many have already been patched. For those who can't immediately apply the security updates released on Tuesday, Fortinet also provides a temporary workaround requiring them to disable 'HTTP/HTTPS Access' from administrative interfaces and restrict access to vulnerable FortiSwitch devices to trusted hosts. On Tuesday, the company also patched an OS command injection (CVE-2024-54024) in FortiIsolator and flaws impacting FortiOS, FortiProxy, FortiManager, FortiAnalyzer, FortiVoice, and FortiWeb (CVE-2024-26013 and CVE-2024-50565) that unauthenticated attackers can exploit in man-in-the-middle attacks. Fortinet vulnerabilities are often targeted in the wild, some exploited as zero days long before the company issues security patches. For instance, in December, Chinese hackers used a DeepData post-exploitation toolkit to steal credentials using a zero-day (with no CVE ID) in Fortinet's FortiClient Windows VPN client. Another Fortinet FortiManager flaw, dubbed \"FortiJump\" and tracked as CVE-2024-47575, has been exploited as a zero-day to breach over 50 servers since June 2024. More recently, Fortinet disclosed two more vulnerabilities (CVE-2024-55591 and CVE-2025-24472) in January and February , also exploited as zero days in ransomware attacks. Update April 10, 11:27 EDT : Added online exposure info from Censys. CISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks SAP fixes suspected NetWeaver zero-day exploited in attacks Craft CMS RCE exploit chain used in zero-day attacks to steal data CISA flags Craft CMS code injection flaw as exploited in attacks Lazarus hackers breach six companies in watering hole attacks In the immortal words of Beavis & Butthead: \" I thee you like breaches! Hehe Hehe, i like breaches too!\" ~Fortinet Users Security flaw!?  Isn't this a feature for net admins?? XD Maybe this is why everyone says Fortinet sucks? Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Overdue a password health-check? Audit your Active Directory for free Enhancing your DevSecOps with Wazuh, the open source XDR platform Learn why identity attacks were the #1 threat facing organizations in 2024 Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-30406"
    ],
    "cve_counts": {
      "CVE-2025-30406": 3
    },
    "title": "CentreStack RCE exploited as zero-day to breach file sharing servers",
    "permalink": "https://www.bleepingcomputer.com/news/security/centrestack-rce-exploited-as-zero-day-to-breach-file-sharing-servers/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Hackers exploited a vulnerability in Gladinet CentreStack's secure file-sharing software as a zero-day since March to breach storage servers Gladinet CentreStack is an enterprise file-sharing and access platform that turns on-premise file servers (like Windows servers with SMB shares) into secure, cloud-like file systems supporting remote access to internal file shares, file syncing and sharing, multi-tenant deployments, and integration with Active Directory. The company claims the product is used by thousands of businesses across 49 countries, including enterprises with Windows-based file servers, MSPs hosting file services for multiple clients, and various organizations that need cloud-like access without cloud migration. The flaw, tracked as CVE-2025-30406, is a deserialization vulnerability impacting Gladinet CentreStack versions up to 16.1.10296.56315. Exploitation in the wild has been observed since March 2025 . The issue stems from using a hardcoded machineKey in the CentreStack portal's configuration (web.config). If an attacker knows this key, they can craft a malicious serialized payload that the server will trust and execute. According to the vendor's advisory, the improperly protected key secures ASP.NET ViewState, which, if forged, can allow attackers to bypass integrity checks, inject arbitrary serialized objects, and eventually execute code on the server. Gladinet released a security fix for CVE-2025-30406 on April 3, 2025, with versions 16.4.10315.56368, 16.3.4763.56357 (Windows), and 15.12.434 (macOS). The vendor recommends that all users upgrade to the latest version for their platforms as soon as possible, or manually rotate the 'machineKey' in both 'root\\web.config' and 'portal\\web.config.' \"Exploitation has been observed in the wild. We strongly recommend updating to the patched version, which improves key management and mitigates exposure,\" advises Gladinet . \"For customers who cannot update immediately, rotating the machineKey values is a recommended interim mitigation.\" Those who perform machineKey rotation on their environment must ensure consistency across nodes in multi-server deployments to avoid operational problems and restart IIS after changes for the mitigations to apply. CISA has added CVE-2025-30406 to its Known Exploited Vulnerability catalog but has not indiciated it has been exploited by ransomware gangs. However, given the nature of the product, it is likely being exploited for data theft attacks. These types of flaws have historically been targeted by the Clop ransomware gang, which has expertise in exploiting file-sharing systems. Previous Clop data theft attacks targeted the Cleo , MOVEit Transfer , GoAnywhere MFT , SolarWinds Serv-U , and Accelion FTA secure file transfer platforms. The U.S. agency has given impacted state and federal organizations until April 29, 2025 , to apply security updates and mitigations or stop using the product. CISA tags Broadcom Fabric OS, CommVault flaws as exploited in attacks CISA flags Craft CMS code injection flaw as exploited in attacks SAP fixes suspected NetWeaver zero-day exploited in attacks Active! Mail RCE flaw exploited in attacks on Japanese orgs CISA tags SonicWall VPN flaw as actively exploited in attacks Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything Learn why identity attacks were the #1 threat facing organizations in 2024 View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Overdue a password health-check? Audit your Active Directory for free Enhancing your DevSecOps with Wazuh, the open source XDR platform Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-29824",
      "CVE-2023-28252",
      "CVE-2025-24983"
    ],
    "cve_counts": {
      "CVE-2025-29824": 3,
      "CVE-2023-28252": 1,
      "CVE-2025-24983": 1
    },
    "title": "Microsoft: Windows CLFS zero-day exploited by ransomware gang",
    "permalink": "https://www.bleepingcomputer.com/news/security/microsoft-windows-clfs-zero-day-exploited-by-ransomware-gang/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Microsoft says the RansomEXX ransomware gang has been exploiting a high-severity zero-day flaw in the Windows Common Log File System to gain SYSTEM privileges on victims' systems. The vulnerability, tracked as CVE-2025-29824 , was patched during this month's Patch Tuesday and was only exploited in a limited number of attacks. CVE-2025-29824 is due to a use-after-free weakness that lets local attackers with low privileges gain SYSTEM privileges in low-complexity attacks that don't require user interaction. While the company has issued security updates for impacted Windows versions, it delayed releasing patches for systems running Windows 10 LTSB 2015 and said they would be released as soon as possible. \"The targets include organizations in the information technology (IT) and real estate sectors of the United States, the financial sector in Venezuela, a Spanish software company, and the retail sector in Saudi Arabia,\" Microsoft revealed today . \"Customers running Windows 11, version 24H2 are not affected by the observed exploitation, even if the vulnerability was present. Microsoft urges customers to apply these updates as soon as possible.\" Microsoft linked these attacks to the RansomEXX ransomware gang, which it tracks as Storm-2460. The attackers first installed the PipeMagic backdoor malware on compromised systems, which was used to deploy the CVE-2025-29824 exploit, ransomware payloads, and !_READ_ME_REXX2_!.txt ransom notes after encrypting files. ​As ESET reported last month, PipeMagic has also been used to deploy exploits targeting a Windows Win32 Kernel Subsystem zero-day ( CVE-2025-24983 ) since March 2023. Discovered by Kaspersky in 2022 , the malware can harvest sensitive data, provides full remote access to infected devices, and enables attackers to deploy additional malicious payloads to move laterally through victims' networks. In 2023, Kaspersky spotted this backdoor while investigating Nokoyawa ransomware attacks . These attacks exploited another Windows Common Log File System Driver zero-day, a privilege escalation flaw tracked as CVE-2023-28252 . The RansomEXX ransomware operation started as Defray in 2018 but was rebranded to RansomEXX and became much more active starting June 2020. This ransomware gang has also targeted high-profile organizations, including computer hardware giant GIGABYTE , Konica Minolta , the Texas Department of Transportation (TxDOT), Brazil's court system , Montreal's STM public transport system , and government software provider Tyler Technologies . New Windows zero-day leaks NTLM hashes, gets unofficial patch EncryptHub linked to MMC zero-day attacks on Windows systems New Windows zero-day exploited by 11 state hacking groups since 2017 Microsoft patches Windows Kernel zero-day exploited since 2023 Microsoft March 2025 Patch Tuesday fixes 7 zero-days, 57 flaws Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Enhancing your DevSecOps with Wazuh, the open source XDR platform Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-29824",
      "CVE-2025-24043"
    ],
    "cve_counts": {
      "CVE-2025-29824": 1,
      "CVE-2025-24043": 1
    },
    "title": "Microsoft April 2025 Patch Tuesday fixes exploited zero-day, 134 flaws",
    "permalink": "https://www.bleepingcomputer.com/news/microsoft/microsoft-april-2025-patch-tuesday-fixes-exploited-zero-day-134-flaws/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Today is Microsoft's April 2025 Patch Tuesday, which includes security updates for 134 flaws, including one actively exploited zero-day vulnerability. This Patch Tuesday also fixes eleven \"Critical\" vulnerabilities, all remote code execution vulnerabilities. The number of bugs in each vulnerability category is listed below: The above numbers do not include Mariner flaws and 13 Microsoft Edge vulnerabilities fixed earlier this month. To learn more about the non-security updates released today, you can review our dedicated articles on the Windows 11 KB5055523 & KB5055528 cumulative updates and the Windows 10 KB5055518 update . This month's Patch Tuesday fixes one actively exploited zero-day. Microsoft classifies a zero-day flaw as publicly disclosed or actively exploited while no official fix is available. The actively exploited zero-day vulnerability in today's updates is: CVE-2025-29824 - Windows Common Log File System Driver Elevation of Privilege Vulnerability Microsoft says this vulnerability allows local attackers to gain SYSTEM privileges on the device/ \"The security update for Windows 10 for x64-based Systems and Windows 10 for 32-bit Systems are not immediately available,\" explained Microsoft. \"The updates will be released as soon as possible, and when they are available, customers will be notified via a revision to this CVE information.\" Microsoft says the patches are not available for Windows 10 LTSB 2015 and will be released in the future. After the publishing of this article, Microsoft shared more details about how the flaw was exploited as a zero-day by the RansomEXX ransomware gang to gain elevated privileges. Microsoft attributes the discovery of this flaw to the Microsoft Threat Intelligence Center. Other vendors who released updates or advisories in April 2025 include: Below is the complete list of resolved vulnerabilities in the April 2025 Patch Tuesday updates. To access the full description of each vulnerability and the systems it affects, you can view the full report here . Microsoft March 2025 Patch Tuesday fixes 7 zero-days, 57 flaws Windows 10 KB5055518 update fixes random text when printing Microsoft: Windows 'inetpub' folder created by security fix, don’t delete Microsoft adds hotpatching support to Windows 11 Enterprise Windows 11 KB5053598 & KB5053602 cumulative updates released All the CVE links are broken, each link has a \"CVE-2025-24043\" in its URL. Fixed. Thanks for letting us know. After installing April 2025 CU on Windows Servers 2022 the OS Build is 20348.3453 and not 20348.3454 as per KB5055526. After installing April 2025 CU on Windows Servers 2022 the OS Build is 20348.3453 and not 20348.3454 as per KB5055526. The full report is missing \"The full report is missing\" +1 on this. I cleared the cache for that path. Should work for you now. I keep my \"nose\" clean, use extensions that detect crap. I don't install any apps or click on links I haven't run through malware scanner. I don't need Windows 11 or Windows 10 to have security updates. In fact, I disabled Windows updates. Once Trump perishes or global tariffs removed, I'll be in a better position to buy a new PC, maybe a Mac. Microsoft has proven repeatedly that without Gates, they are run by monkeys. Is Mikrotek a typo? Is Mediatek correct? This has not been one of my finest. Fixed. Thanks. Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Rethinking Automated Penetration Testing: Why Validation Changes Everything Enhancing your DevSecOps with Wazuh, the open source XDR platform Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-30401"
    ],
    "cve_counts": {
      "CVE-2025-30401": 2
    },
    "title": "WhatsApp flaw can let attackers run malicious code on Windows PCs",
    "permalink": "https://www.bleepingcomputer.com/news/security/whatsapp-flaw-can-let-attackers-run-malicious-code-on-windows-pcs/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Meta warned Windows users to update the WhatsApp messaging app to the latest version to patch a vulnerability that can let attackers execute malicious code on their devices. Described as a spoofing issue and tracked as CVE-2025-30401 , this security flaw can be exploited by attackers by sending maliciously crafted files with altered file types to potential targets. Meta says the vulnerability impacted all WhatsApp versions and has been fixed with the release of WhatsApp 2.2450.6. \"A spoofing issue in WhatsApp for Windows prior to version 2.2450.6 displayed attachments according to their MIME type but selected the file opening handler based on the attachment's filename extension,\" WhatsApp explained in a Tuesday advisory . \"A maliciously crafted mismatch could have caused the recipient to inadvertently execute arbitrary code rather than view the attachment when manually opening the attachment inside WhatsApp.\" Meta says an external researcher found and reported the flaw via a Meta Bug Bounty submission. The company has yet to share if CVE-2025-30401 was exploited in the wild. In July 2024, WhatsApp addressed a slightly similar issue that allowed Python and PHP attachments to be executed without warning when recipients opened them on Windows devices with Python installed. More recently, following reports from security researchers at the University of Toronto's Citizen Lab, WhatsApp also patched a zero-click, zero-day security vulnerability that was exploited to install Paragon's Graphite spyware. The company said the attack vector was addressed late last year \"without the need for a client-side fix\" and decided against assigning a CVE-ID after \"reviewing the CVE guidelines published by MITRE, and [its] own internal policies.\" On January 31, after mitigating the security issue server-side, WhatsApp alerted roughly 90 Android users from over two dozen countries, including Italian journalists and activists who were targeted in Paragon spyware attacks using the zero-click exploit. Last December, a U.S. federal judge also ruled that Israeli spyware maker NSO Group used WhatsApp zero-days to deploy Pegasus spyware on at least 1,400 devices, thus violating U.S. hacking laws. Court documents revealed that NSO allegedly deployed Pegasus spyware in zero-click attacks that exploited WhatsApp vulnerabilities using multiple zero-day exploits. The documents also said that the spyware maker's developers reverse-engineered WhatsApp's code to create tools that sent malicious messages that installed spyware, violating federal and state laws. Critical PHP RCE vulnerability mass exploited in new attacks SAP fixes suspected NetWeaver zero-day exploited in attacks Active! Mail RCE flaw exploited in attacks on Japanese orgs Max severity RCE flaw discovered in widely used Apache Parquet WordPress security plugin WP Ghost vulnerable to remote code execution bug How does WhatsApp get updated in Windows? MS Store? Yes, MS Store. It should be updated automatically, too. Current version is 2.2513.4.0. Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free Enhancing your DevSecOps with Wazuh, the open source XDR platform View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Rethinking Automated Penetration Testing: Why Validation Changes Everything Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2024-50302",
      "CVE-2024-53197",
      "CVE-2024-53104",
      "CVE-2024-53150",
      "CVE-2024-43047"
    ],
    "cve_counts": {
      "CVE-2024-50302": 1,
      "CVE-2024-53197": 1,
      "CVE-2024-53104": 1,
      "CVE-2024-53150": 1,
      "CVE-2024-43047": 1
    },
    "title": "Google fixes Android zero-days exploited in attacks, 60 other flaws",
    "permalink": "https://www.bleepingcomputer.com/news/security/google-fixes-android-zero-days-exploited-in-attacks-60-other-flaws/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Google has released patches for 62 vulnerabilities in Android's April 2025 security update, including two zero-days exploited in targeted attacks. One of the zero-days, a high-severity privilege escalation security vulnerability ( CVE-2024-53197 ) in the Linux kernel's USB-audio driver for ALSA Devices, was reportedly exploited by Serbian authorities to unlock confiscated Android devices as part of a zero-day exploit chain developed by Israeli digital forensics company Cellebrite. This exploit chain—which also included a USB Video Class zero-day (CVE-2024-53104) patched in February and a Human Interface Devices zero-day (CVE-2024-50302) patched last month )—was discovered by Amnesty International's Security Lab in mid-2024 while analyzing logs found on devices unlocked by Serbian police. Google told BleepingComputer in February that these fixes were shared with OEM partners in January. \"We were aware of these vulnerabilities and exploitation risk prior to these reports and promptly developed fixes for Android. Fixes were shared with OEM partners in a partner advisory on January 18,\" a Google spokesperson told BleepingComputer. This month's second zero-day fixed ( CVE-2024-53150 ) is an Android Kernel information disclosure vulnerability caused by an out-of-bounds read weakness that enables local attackers to access sensitive information on vulnerable devices without user interaction. The March 2025 Android security updates also patch 60 other security vulnerabilities, most of which are high-severity elevation of privilege flaws. Google issued two sets of security patches, the 2025-04-01 and 2025-04-05 security patch levels. The latter provides all the fixes from the first batch and security patches for closed-source third-party and kernel subcomponents, which may not necessarily apply to all Android devices. Google Pixel devices receive these updates immediately, while other vendors often take longer to test and fine-tune the security patches for their specific hardware configurations. In November 2024, Google also fixed another Android zero-day (CVE-2024-43047), first tagged as exploited by Google Project Zero in October 2024 and used by the Serbian government in NoviSpy spyware attacks against Android devices belonging to activists, journalists, and protestors. Google fixes Android zero-day exploited by Serbian authorities Google fixes two Android zero-days used in targeted attacks Serbian police used Cellebrite zero-day hack to unlock Android phones Microsoft patches Windows Kernel zero-day exploited since 2023 Broadcom fixes three VMware zero-days exploited in attacks Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Enhancing your DevSecOps with Wazuh, the open source XDR platform Overdue a password health-check? Audit your Active Directory for free Learn why identity attacks were the #1 threat facing organizations in 2024 Rethinking Automated Penetration Testing: Why Validation Changes Everything Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2024-55956",
      "CVE-2024-50623"
    ],
    "cve_counts": {
      "CVE-2024-55956": 1,
      "CVE-2024-50623": 1
    },
    "title": "Food giant WK Kellogg discloses data breach linked to Clop ransomware",
    "permalink": "https://www.bleepingcomputer.com/news/security/food-giant-wk-kellogg-discloses-data-breach-linked-to-clop-ransomware/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  US food giant WK Kellogg Co is warning employees and vendors that company data was stolen during the 2024 Cleo data theft attacks. Cleo software is a managed file transfer utility that was targeted by the Clop ransomware gang en masse at the end of last year. This attack leveraged two zero-day flaws tracked as CVE-2024-50623 and CVE-2024-55956, allowing the threat actors to breach servers and steal data. \"WK Kellogg learned on February 27, 2025, that a security incident may have occurred involving Cleo,\" reads the notice . \"WK Kellogg immediately began to investigate. We contacted Cleo, and Cleo informed us that an unauthorized person gained access on December 7, 2024, to the servers Cleo hosted for us that were used for transferring employee files to our human resources service vendors.\" WK Kellogg Co is an American food manufacturing giant split from Kellogg's in October 2023. It has an annual revenue of $2.7 billion and owns popular cereal brands such as All-Bran, Corn Flakes, Froot Loops, and Frosted Flakes. Although the company does not specifically mention Clop or the data theft attacks, the date of the reported incidents coincides with the wave of attacks that occurred in December 2024. Furthermore, the breach notifications come soon after the Clop ransomware gang listed WK Kellogg on their data leak extortion site. The data breach notification shared with the authorities says the exposed data includes a person's name and social security number. The letter encloses instructions on how recipients can enroll in a free one-year identity monitoring and fraud protection services through Kroll. Impacted individuals are also recommended to consider placing fraud alerts or a security freeze on their credit file. Kellogg says it worked closely with Cleo to identify the security measures it implemented to address last year's breach and prevent similar incidents from occurring in the future. Kellogg is the latest victim of a long list of companies impacted by Clop's Cleo zero-day attacks, with the threat actors gradually disclosing additional victims and stolen data samples several months after the incident. The previous disclosure came on March 18 by Arizona-based Western Alliance Bank , which informed 22,000 customers their personal data had been stolen in an October 2024 breach of Cleo's secure file transfer software. Western Alliance Bank notifies 21,899 customers of data breach VeriSource now says February data breach impacts 4 million people Baltimore City Public Schools data breach affects over 31,000 people Frederick Health data breach impacts nearly 1 million patients Ahold Delhaize confirms data theft after INC ransomware claims attack Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Rethinking Automated Penetration Testing: Why Validation Changes Everything View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Enhancing your DevSecOps with Wazuh, the open source XDR platform Overdue a password health-check? Audit your Active Directory for free Learn why identity attacks were the #1 threat facing organizations in 2024 Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-30065"
    ],
    "cve_counts": {
      "CVE-2025-30065": 3
    },
    "title": "Max severity RCE flaw discovered in widely used Apache Parquet",
    "permalink": "https://www.bleepingcomputer.com/news/security/max-severity-rce-flaw-discovered-in-widely-used-apache-parquet/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  A maximum severity remote code execution (RCE) vulnerability has been discovered impacting all versions of Apache Parquet up to and including 1.15.0. The problem stems from the deserialization of untrusted data that could allow attackers with specially crafted Parquet files to gain control of target systems, exfiltrate or modify data, disrupt services, or introduce dangerous payloads such as ransomware. The vulnerability is tracked under CVE-2025-30065 and has a CVSS v4 score of 10.0. The flaw was fixed with the release of Apache version 1.15.1. It should be noted that to exploit this flaw, threat actors must convince someone to import a specially crafted Parquet file. Apache Parquet is an open-source, columnar storage format designed for efficient data processing. Unlike row-based formats (like CSV), Parquet stores data by columns, which makes it faster and more space-efficient for analytical workloads. It is widely adopted across the data engineering and analytics ecosystem, including big data platforms like Hadoop, AWS, Amazon, Google, and Azure cloud services, data lakes, and ETL tools. Some large companies that use Parquet include Netflix, Uber, Airbnb, and LinkedIn. The security problem in Parquet was disclosed on April 1, 2025, following a responsible disclosure by its finder, Amazon researcher Keyi Li. \"Schema parsing in the parquet-avro module of Apache Parquet 1.15.0 and previous versions allows bad actors to execute arbitrary code,\" warned the short bulletin published on Openwall . \"Users are recommended to upgrade to version 1.15.1, which fixes the issue.\" A separate bulletin by Endor Labs highlights the risk of CVE-2025-30065 exploitation more clearly, warning that the flaw can impact any data pipelines and analytics systems that import Parquet files, with the risk being significant for files sourced from external points. Endor Labs believes the problem was introduced in Parquet version 1.8.0, though older releases might also be impacted. The firm suggests coordinated checks with developers and vendors to determine what Praquet versions are used in production software stacks. \"If an attacker tricks a vulnerable system into reading a specially crafted Parquet file, they could gain remote code execution (RCE) on that system,\" warns Endor Labs . However, the security firm avoids over-inflating the risk by including the note, \"Despite the frightening potential, it's important to note that the vulnerability can only be exploited if a malicious Parquet file is imported.\" That being said, if upgrading to Apache Parquet 1.15.1 immediately is impossible, it is suggested to avoid untrusted Parquet files or carefully validate their safety before processing them. Also, monitoring and logging on systems that handle Parquet processing should be increased. Although no active exploitation has been discovered yet, the risk is high due to the flaw's severity and the widespread use of Parquet files in big data applications. Administrators of impacted systems are recommended to upgrade to Parquet version 1.15.1, which addresses CVE-2025-30065, as soon as possible. Critical RCE flaw in Apache Tomcat actively exploited in attacks SAP fixes suspected NetWeaver zero-day exploited in attacks Active! Mail RCE flaw exploited in attacks on Japanese orgs WhatsApp flaw can let attackers run malicious code on Windows PCs WordPress security plugin WP Ghost vulnerable to remote code execution bug Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Overdue a password health-check? Audit your Active Directory for free View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Enhancing your DevSecOps with Wazuh, the open source XDR platform Learn why identity attacks were the #1 threat facing organizations in 2024 Rethinking Automated Penetration Testing: Why Validation Changes Everything Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2023-46805",
      "CVE-2025-0282",
      "CVE-2025-22457",
      "CVE-2024-21887"
    ],
    "cve_counts": {
      "CVE-2023-46805": 1,
      "CVE-2025-0282": 1,
      "CVE-2025-22457": 2,
      "CVE-2024-21887": 1
    },
    "title": "Ivanti patches Connect Secure zero-day exploited since mid-March",
    "permalink": "https://www.bleepingcomputer.com/news/security/ivanti-patches-connect-secure-zero-day-exploited-since-mid-march/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Ivanti has released security updates to patch a critical Connect Secure remote code execution vulnerability exploited by a China-linked espionage actor to deploy malware since at least mid-March 2025. Tracked as CVE-2025-22457 , this critical security flaw is due to a stack-based buffer overflow weakness. It impacts Pulse Connect Secure 9.1x (which reached end-of-support in December), Ivanti Connect Secure 22.7R2.5 and earlier, Policy Secure, and Neurons for ZTA gateways. According to Ivanti's advisory , remote threat actors can exploit it in high-complexity attacks that don't require authentication or user interaction. The company patched the vulnerability on February 11, 2025, with the release of Ivanti Connect Secure 22.7R2.6 after initially tagging it as a product bug. \"The vulnerability is a buffer overflow with characters limited to periods and numbers, it was evaluated and determined not to be exploitable as remote code execution and didn't meet the requirements of denial of service,\" Ivanti said on Thursday . \"However, Ivanti and our security partners have now learned the vulnerability is exploitable through sophisticated means and have identified evidence of active exploitation in the wild. We encourage all customers to ensure they are running Ivanti Connect Secure 22.7R2.6 as soon as possible, which remediates the vulnerability.\" While security patches for ZTA and Ivanti Policy Secure gateways are still in development and will be released on April 19 and April 21, respectively, Ivanti said that it's \"not aware of any exploitation\" targeting these gateways, which also have what \"meaningfully reduced risk from this vulnerability.\" Ivanti also advised admins to monitor their external Integrity Checker Tool (ICT) and look for web server crashes. If any signs of compromise are discovered, admins should factory reset impacted appliances and put them back in production using software version 22.7R2.6. While Ivanti has yet to disclose more details regarding CVE-2025-22457 attacks, Mandiant and Google Threat Intelligence Group (GTIG) security researchers revealed today that a suspected China-nexus espionage actor exploited the vulnerability tracked as UNC5221 since at least mid-March 2025. \"Following successful exploitation, we observed the deployment of two newly identified malware families, the TRAILBLAZE in-memory only dropper and the BRUSHFIRE passive backdoor. Additionally, deployment of the previously reported SPAWN ecosystem of malware attributed to UNC5221 was also observed,\" Mandiant said . \"We assess it is likely the threat actor studied the patch for the vulnerability in ICS 22.7R2.6 and uncovered through a complicated process, it was possible to exploit 22.7R2.5 and earlier to achieve remote code execution.\" UNC5221 is known for targeting zero-day vulnerabilities in network edge devices since 2023, including various Ivanti and NetScaler appliances. Most recently, the Chinese hackers exploited CVE-2025-0282 , another Ivanti Connect Secure buffer overflow, to drop new Dryhook and Phasejam malware on compromised VPN appliances. One year ago, the hacking group also chained two Connect Secure and Policy Secure zero-days (CVE-2023-46805 and CVE-2024-21887) to remotely execute arbitrary commands on targeted ICS VPN and IPS network access control (NAC) appliances . One of their victims was the MITRE Corporation , which disclosed the breach in April 2024. ​Threat intelligence company Volexity said in January 2024 that UNC5221 had backdoored over 2,100 Ivanti appliances using the GIFTEDVISITOR webshell in attacks chaining the two zero days. As CISA and the FBI warned in January 2025, attackers are still breaching vulnerable networks using exploits targeting Ivanti Cloud Service Appliances (CSA) security vulnerabilities patched since September. Multiple other Ivanti security flaws have been exploited as zero-days over the last year against the company's VPN appliances and ICS, IPS, and ZTA gateways . Update April 03, 14:16 EDT: Ivanti CSO Daniel Spicer sent the following statement after the story was published. Network security devices and edge devices in particular are a focus of sophisticated and highly persistent threat actors, and Ivanti is committed to providing information to defenders to ensure they can take every possible step to secure their environments. To this end, in addition to providing an advisory directly to customers, Ivanti worked closely with its partner Mandiant to provide additional information regarding this recently addressed vulnerability. Importantly, this vulnerability was fixed in ICS 22.7R2.6, released February 11, 2025, and customers running supported versions on their appliances and in accordance with the guidance provided by Ivanti have a significantly reduced risk. Ivanti’s Integrity Checker Tool (ICT) has been successful in detecting potential compromise on a limited number of customers running ICS 9.X (end of life) and 22.7R2.5 and earlier versions. Ivanti Connect Secure zero-days now under mass exploitation Ivanti zero-day attacks infected devices with custom malware Ivanti Connect Secure zero-days exploited to deploy custom malware SAP fixes suspected NetWeaver zero-day exploited in attacks Ivanti: VPN appliances vulnerable if pushing configs after mitigation Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Rethinking Automated Penetration Testing: Why Validation Changes Everything Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free Enhancing your DevSecOps with Wazuh, the open source XDR platform Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-24180",
      "CVE-2025-24228",
      "CVE-2025-24178",
      "CVE-2025-31182",
      "CVE-2025-24097",
      "CVE-2025-30427",
      "CVE-2025-24201",
      "CVE-2025-24200",
      "CVE-2025-24213",
      "CVE-2025-30456",
      "CVE-2025-24267",
      "CVE-2025-24085"
    ],
    "cve_counts": {
      "CVE-2025-24180": 1,
      "CVE-2025-24228": 1,
      "CVE-2025-24178": 1,
      "CVE-2025-31182": 1,
      "CVE-2025-24097": 1,
      "CVE-2025-30427": 1,
      "CVE-2025-24201": 2,
      "CVE-2025-24200": 2,
      "CVE-2025-24213": 1,
      "CVE-2025-30456": 1,
      "CVE-2025-24267": 1,
      "CVE-2025-24085": 2
    },
    "title": "Apple backports zero-day patches to older iPhones and Macs",
    "permalink": "https://www.bleepingcomputer.com/news/security/apple-backports-zero-day-patches-to-older-iphones-and-macs/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Apple has released security updates that backport fixes for actively exploited vulnerabilities that were exploited as zero-days to older versions of its operating systems. At the same time, the consumer tech giant released security updates for the latest stable iOS, iPadOS, and macOS, addressing numerous security flaws. The first backport concerns CVE-2025-24200 , a flaw discovered by Citizen Lab that was exploited by mobile forensic tools to disable 'USB Restricted Mode' on locked devices. Apple addressed the flaw in iOS 18.3.1, iPadOS 18.3.1, and 17.7.5, released on February 10, 2025. The second vulnerability backported to older OS versions is CVE-2025-24201 , which allowed hackers to break out of the Web Content sandbox on the WebKit engine using specially crafted web content. Apple warned that the flaw was exploited in \"extremely sophisticated\" attacks, fixing it on March 11, 2025, with the release of iOS 18.3.2, iPadOS 18.3.2, macOS Sequoia 15.3.2, visionOS 2.3.2, and Safari 18.3.1. The vendor has now incorporated fixes for both CVE-2025-24200 and CVE-2025-24201 in iOS 16.7.11 and 15.8.4 and iPadOS versions 16.7.11 and 15.8.4 . The third flaw fixed on older devices is CVE-2025-24085 , a privilege escalation problem in Apple's Core Media framework. The firm fixed the issue in late January 2025 with the release of iOS 18.3, iPadOS 18.3, macOS Sequoia 15.3, watchOS 11.3, visionOS 2.3, and tvOS 18.3. Now, fixes for CVE-2025-24085 were made available through iPadOS 17.7.6 , and macOS versions 14.7.5 (Sonoma) and 13.7.5 (Ventura). In addition to the backports, Apple also released security updates for the latest stable branches of its operating systems and software like Safari and Xcode. Specifically, the latest update for iOS 18.4 and iPadOS 18.4 fixes 77 vulnerabilities, including CVE-2025-30456 (app sandbox bypass allowing root privilege escalation), CVE-2025-24097 (arbitrary file metadata access), and CVE-2025-31182 (arbitrary file deletion). On macOS Sequoia 15.4 , Apple addressed 123 vulnerabilities, including CVE-2025-24228 (arbitrary code execution with kernel privileges), CVE-2025-24267 (privilege escalation to root), and CVE-2025-24178 (sandbox escape). On the latest Safari 18.4, Apple addressed 13 flaws including CVE-2025-24213 (WebKit memory corruption), CVE-2025-30427 (WebKit use-after-free), and CVE-2025-24180 (WebAuthn credential confusion). While no actively exploited zero-day flaws were disclosed in these bulletins, users should apply the updates as soon as possible to remain protected against attacks. Apple fixes WebKit zero-day exploited in ‘extremely sophisticated’ attacks Apple 'AirBorne' flaws can lead to zero-click AirPlay RCE attacks Apple fixes two zero-days exploited in targeted iPhone attacks Verizon Call Filter API flaw exposed customers' incoming call history Russian army targeted by new Android malware hidden in mapping app Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key Enhancing your DevSecOps with Wazuh, the open source XDR platform View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free Rethinking Automated Penetration Testing: Why Validation Changes Everything Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  },
  {
    "cves": [
      "CVE-2025-31161",
      "CVE-2025-2825",
      "CVE-2023-43177",
      "CVE-2024-4040"
    ],
    "cve_counts": {
      "CVE-2025-31161": 2,
      "CVE-2025-2825": 4,
      "CVE-2023-43177": 1,
      "CVE-2024-4040": 2
    },
    "title": "Critical auth bypass bug in CrushFTP now exploited in attacks",
    "permalink": "https://www.bleepingcomputer.com/news/security/critical-auth-bypass-bug-in-crushftp-now-exploited-in-attacks/",
    "text": "SonicWall: SMA100 VPN vulnerabilities now exploited in attacks UK retailer Co-op shuts down some IT systems after hack attempt Microsoft: Windows 11 24H2 updates fail with 0x80240069 errors Marks & Spencer breach linked to Scattered Spider ransomware attack Hackers abuse IPv6 networking feature to hijack software updates WordPress plugin disguised as a security tool injects backdoor WhatsApp unveils 'Private Processing' for cloud-based AI features Kickstart your CISSP prep with this $30 cybersecurity course deal How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  Attackers are now targeting a critical authentication bypass vulnerability in the CrushFTP file transfer software using exploits based on publicly available proof-of-concept code. The security vulnerability ( CVE-2025-2825 ) was discovered and reported by Outpost24 (which identifies it as CVE-2025-31161 ), and it allows remote attackers to gain unauthenticated access to devices running unpatched CrushFTP v10 or v11 software. \"Please take immediate action to patch ASAP. The bottom line of this vulnerability is that an exposed HTTP(S) port could lead to unauthenticated access,\" CrushFTP warned in an email sent to customers on Friday, March 21, when it released patches to address the security flaw. As a workaround, admins who can't immediately update CrushFTP 10.8.4 and later or 11.3.1 and later can enable the DMZ (demilitarized zone) perimeter network option to protect their CrushFTP servers until they can patch. A week later, security threat monitoring platform Shadowserver warned that its honeypots detected dozens of exploitation attempts targeting Internet-exposed CrushFTP servers, with over 1,500 vulnerable instances exposed online. ​The warning comes days after ProjectDiscovery published a write-up containing technical details and a proof-of-concept exploit on the CVE-2025-2825/CVE-2025-31161 vulnerability. \"We are observing CrushFTP CVE-2025-2825 exploitation attempts based on publicly available PoC exploit code,\" Shadowserver said on Monday. \"Still 1512 unpatched instances vulnerable to CVE-2025-2825 seen on 2025-03-30.\" File transfer products such as CrushFTP are high on ransomware gangs' list of targets , specifically Clop, which has been linked to data theft attacks targeting zero-day flaws in Accelion FTA , MOVEit Transfer , GoAnywhere MFT , and, most recently, Cleo software. One year ago, in April 2024, CrushFTP patched an actively exploited zero-day vulnerability (tracked as CVE-2024-4040 ) that let unauthenticated attackers escape the user's virtual file system (VFS) and download system files. At the time, cybersecurity company CrowdStrike found evidence that the campaign targeting CrushFTP servers at multiple U.S. organizations was likely politically motivated and focused on intelligence-gathering. The Cybersecurity and Infrastructure Security Agency (CISA) also added CVE-2024-4040 to its Known Exploited Vulnerabilities catalog, ordering federal agencies to secure vulnerable systems on their networks within a week . CrushFTP customers were also warned to patch a critical remote code execution bug ( CVE-2023-43177 ) in the company's enterprise suite in November 2023 after Converge security researchers (who discovered and reported the flaw) released a proof-of-concept exploit three months after security updates were released. Update April 03, 06:54 EDT: Added information on the second CVE-ID assigned to this CrushFTP authentication bypass flaw. SAP fixes suspected NetWeaver zero-day exploited in attacks Hackers exploit WordPress plugin auth bypass hours after disclosure New Mirai botnet behind surge in TVT DVR exploitation Newest Ivanti SSRF zero-day now under mass exploitation CrushFTP warns users to patch unauthenticated access flaw immediately Not a member yet? Register Now Marks & Spencer breach linked to Scattered Spider ransomware attack Hitachi Vantara takes servers offline after Akira ransomware attack Kali Linux warns of update failures after losing repo signing key View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Learn why identity attacks were the #1 threat facing organizations in 2024 Overdue a password health-check? Audit your Active Directory for free Rethinking Automated Penetration Testing: Why Validation Changes Everything Enhancing your DevSecOps with Wazuh, the open source XDR platform Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  }
]