[
  {
    "cves": [
      "CVE-2025-42599"
    ],
    "cve_counts": {
      "CVE-2025-42599": 2
    },
    "title": "Active! Mail RCE flaw exploited in attacks on Japanese orgs",
    "permalink": "https://www.bleepingcomputer.com/news/security/active-mail-rce-flaw-exploited-in-attacks-on-japanese-orgs/",
    "text": "SK Telecom warns customer USIM data exposed in malware attack Cookie-Bite attack PoC uses Chrome extension to steal session tokens Ripple's recommended XRP library xrpl.js hacked to steal wallets Hackers abuse Zoom remote control feature for crypto-theft attacks Marks & Spencer confirms a cyberattack as customers face delayed orders Active! Mail RCE flaw exploited in attacks on Japanese orgs Hackers abuse Zoom remote control feature for crypto-theft attacks Windows 10 KB5055612 preview update fixes a GPU bug in WSL2 How to access the Dark Web using the Tor Browser How to enable Kernel-mode Hardware-enforced Stack Protection in Windows 11 How to use the Windows Registry Editor How to backup and restore the Windows Registry How to start Windows in Safe Mode How to remove a Trojan, Virus, Worm, or other Malware How to show hidden files in Windows 7 How to see hidden files in Windows Remove the Theonlinesearch.com Search Redirect Remove the Smartwebfinder.com Search Redirect How to remove the PBlock+ adware browser extension Remove the Toksearches.xyz Search Redirect Remove Security Tool and SecurityTool (Uninstall Guide) How to Remove WinFixer / Virtumonde / Msevents / Trojan.vundo How to remove Antivirus 2009 (Uninstall Instructions) How to remove Google Redirects or the TDSS, TDL3, or Alureon rootkit using TDSSKiller Locky Ransomware Information, Help Guide, and FAQ CryptoLocker Ransomware Information Guide and FAQ CryptorBit and HowDecrypt Information Guide and FAQ CryptoDefense and How_Decrypt Ransomware Information Guide and FAQ Qualys BrowserCheck STOPDecrypter AuroraDecrypter FilesLockerDecrypter AdwCleaner ComboFix RKill Junkware Removal Tool eLearning IT Certification Courses Gear + Gadgets Security Best VPNs How to change IP address Access the dark web safely Best VPN for YouTube  An Active! Mail zero-day remote code execution vulnerability is actively exploited in attacks on large organizations in Japan. Active! mail is a web-based email client developed initially by TransWARE and later acquired by Qualitia, both Japanese companies. While it's not widely used worldwide like Gmail or Outlook, Active! is often used as a groupware component in Japanese-language environments of large corporations, universities, government agencies, and banks. According to the vendor, Active! is used in over 2,250 organizations , boasting over 11,000,000 accounts, making it a significant player in the country's business webmail market. Late last week, Qualitia released a security bulletin about a stack-based buffer overflow vulnerability tracked under CVE-2025-42599 (CVSS v3 score: 9.8, \"critical\") impacting all versions of Active! up to and including 'BuildInfo: 6.60.05008561' on all supported OS platforms. \"If a maliciously crafted request is sent by a remote third party, there is a possibility of arbitrary code execution or a denial-of-service (DoS) condition being triggered,\" reads the bulletin . Although Qualitia mentions investigating whether the flaw has been exploited, Japan's CERT has confirmed its active exploitation status , urging all users to update to Active! Mail 6 BuildInfo: 6.60.06008562 as soon as possible. Japanese web hosting and IT services (SMB) provider Kagoya Japan reported several external attacks over the weekend, prompting it to temporarily suspend the service. \"We suspect that this issue is related to a vulnerability disclosed by QUALITIA (the developer),\" reads the bulletin Kagoya published earlier . A similar service outage following believed exploitation attempts was also reported by web hosting and IT services provider WADAX. \"At this stage, we cannot yet guarantee the safe use of the service for our customers,\" announced WADAX . \"Therefore, with customer safety as our top priority, we have temporarily suspended the Active! mail service as a precaution.\" Macnica security researcher Yutaka Sejiyama told BleepingComputer that at least 227 internet-exposed Active! servers that are potentially exposed to these attacks, with 63 of them used in universities. Japan's CERT has proposed specific mitigation steps for those unable to apply the security update immediately, including configuring the Web Application Firewall (WAF) to enable HTTP request body inspection and block multipart/form-data headers if their size exceeds a certain threshold. Update 4/23 - Japanese internet services provider IIJ has also announced it was impacted by attacks targeting CVE-2025-42599, compromising customer information . The attacks were first detected on April 15 , indicating exploitation of the flaw as a zero-day. Critical RCE flaw in Apache Tomcat actively exploited in attacks Critical PHP RCE vulnerability mass exploited in new attacks SonicWall SMA VPN devices targeted in attacks since January CISA tags SonicWall VPN flaw as actively exploited in attacks CentreStack RCE exploited as zero-day to breach file sharing servers Not a member yet? Register Now Phishers abuse Google OAuth to spoof Google in DKIM replay attack Microsoft Entra account lockouts caused by user token logging mishap State-sponsored hackers embrace ClickFix social engineering tactic Overdue a password health-check? Audit your Active Directory for free Overdue a password health-check? Audit your Active Directory for free Enhancing your DevSecOps with Wazuh, the open source XDR platform View your organization's attack surface & digital frauds  - at no cost. Register now for CTM360's Community Edition Rethinking Automated Penetration Testing: Why Validation Changes Everything Terms of Use - Privacy Policy - Ethics Statement - Affiliate Disclosure Copyright @ 2003 - 2025 Bleeping Computer ® LLC -   All Rights Reserved Not a member yet? Register Now Read our posting guidelinese to learn what content is prohibited.",
    "comments": []
  }
]